In [1]:
import os
import pymysql
import pandas as pd
password = os.environ.get('MYSQL_PASSWORD')

In [2]:
try:
    con = pymysql.connect(
                            host='localhost',
                            user='root',
                            password=password,
                            charset='utf8mb4'
                            )
    print("Connection to the database was successful!")
except pymysql.Error as e:
    print(f"An error occurred while connecting to the database: {e}")

Connection to the database was successful!

In [3]:
# Some useful functions: 


# calling this function makes life easy and just need to pass the name of the database I want to make a query on
# It serves like USE keyword in SQL

def connector (database, password=password, host='localhost', 
               user='root', charset='utf8mb4',):
    
    conn = pymysql.connect(
                        host=host,
                        user=user,
                        password=password,
                        charset=charset, 
                        database=database)
    
    return conn

# to get my tables' names in the datanase

def table_names (database):
    
    con = connector(database)
    
    query = "SELECT table_name FROM information_schema.tables WHERE table_schema='{}';".format(database)

    # Execute the query and store the results in a Pandas DataFrame
    tables = pd.read_sql_query(query, con)

    # Print the list of tables
    return tables

def delete_database(database):
    conn = connector(database=None)
    cursor = conn.cursor()

    # Replace <database_name> with the name of the database you want to delete
    database_name = database

    # Execute the DROP DATABASE SQL command
    cursor.execute(f"DROP DATABASE {database_name}")

    # Commit the transaction
    conn.commit()

    # Close the connection
    conn.close()

def database_creator(database_name):
    
    conn = connector(database=None)
    
    # Create a cursor object
    cursor = conn.cursor()

    cursor.execute(f"DROP DATABASE IF EXISTS {database_name}")
    
    # Execute the CREATE DATABASE SQL command
    cursor.execute(f"CREATE DATABASE {database_name}")

    # Commit the transaction
    conn.commit()

    # Close the connection
    conn.close()

def insert_data_to_table(database_name, table_name, schema, data):
    # Connect to the database
    conn = connector(database_name)

    # Create a cursor object
    cursor = conn.cursor()

    # Create the table with the given schema if it does not exist
    cursor.execute(f"CREATE TABLE IF NOT EXISTS {table_name} ({schema})")

    # Truncate the table to remove any existing data
    cursor.execute(f"TRUNCATE TABLE {table_name}")

    # Insert data into the table
    for row in data:
        placeholders = ",".join(["%s" for _ in range(len(row))])
        query = f"INSERT INTO {table_name} VALUES ({placeholders})"
        cursor.execute(query, row)

    # Commit the transaction to save the changes
    conn.commit()

    # Close the connection
    conn.close()

# This is a modified version of the insert_data_to_table to take care of when we have one item in each
# tuple like data = [('Math'), ('Physics'), ('Programming')] in Q 1280

def insert_data_to_table_modified(database_name, table_name, schema, data):
    # Connect to the database
    conn = connector(database_name)

    # Create a cursor object
    cursor = conn.cursor()

    # Create the table with the given schema if it does not exist
    cursor.execute(f"CREATE TABLE IF NOT EXISTS {table_name} ({schema})")

    # Truncate the table to remove any existing data
    cursor.execute(f"TRUNCATE TABLE {table_name}")

     # Insert data into the table
    for row in data:
        if type (row) == tuple:
            placeholders = ",".join(["%s" for _ in range(len(row))])
            query = f"INSERT INTO {table_name} VALUES ({placeholders})"
            cursor.execute(query, row)
        else:
            query = f"INSERT INTO {table_name} VALUES (%s)"
            cursor.execute(query, row)

    # Commit the transaction to save the changes
    conn.commit()

    # Close the connection
    conn.close()

# How to get the names of all the databases in my MySQL server 

def database_names():

    # Create a cursor object
    cursor = con.cursor()

    # Execute the SHOW DATABASES command
    cursor.execute('SHOW DATABASES')

    # Fetch all the results as a list of tuples
    results = cursor.fetchall()

    # Print the names of all databases in the MySQL server
    for row in results:
        print(row[0])

    # Close the cursor and connection
    cursor.close()
    con.close()

In [4]:
con = connector('sql_invoicing')

In [4]:
database_names()

Leetcode_Q_1050
Leetcode_Q_1068
Leetcode_Q_1075
Leetcode_Q_1084
Leetcode_Q_1141
Leetcode_Q_1148
Leetcode_Q_1179
Leetcode_Q_1211
Leetcode_Q_1251
Leetcode_Q_1280
Leetcode_Q_1327
Leetcode_Q_1378
Leetcode_Q_1393
Leetcode_Q_1407
Leetcode_Q_1484
Leetcode_Q_1517
Leetcode_Q_1527
Leetcode_Q_1581
Leetcode_Q_1587
Leetcode_Q_1633
Leetcode_Q_1661
Leetcode_Q_1667
Leetcode_Q_1683
Leetcode_Q_1693
Leetcode_Q_1729
Leetcode_Q_1731
Leetcode_Q_1741
Leetcode_Q_1757
Leetcode_Q_1789
Leetcode_Q_1795
Leetcode_Q_181
Leetcode_Q_182
Leetcode_Q_183
Leetcode_Q_1873
Leetcode_Q_1890
Leetcode_Q_196
Leetcode_Q_1965
Leetcode_Q_197
Leetcode_Q_1978
Leetcode_Q_2356
Leetcode_Q_511
Leetcode_Q_577
Leetcode_Q_584
Leetcode_Q_586
Leetcode_Q_595
Leetcode_Q_596
Leetcode_Q_607
Leetcode_Q_610
Leetcode_Q_619
Leetcode_Q_620
Leetcode_Q_627
information_schema
mysql
performance_schema
sql_hr
sql_inventory
sql_invoicing
sql_store
sys

# Leetcode Question 1757: Recyclable and Low Fat Products

In [6]:
database_creator ('Leetcode_Q_1757')

In [ ]:
# here is the SQL Schema for the question 1757 on Leetcode - database 

Create table If Not Exists Products (product_id int, low_fats ENUM('Y', 'N'), recyclable ENUM('Y','N'))
Truncate table Products
insert into Products (product_id, low_fats, recyclable) values ('0', 'Y', 'N')
insert into Products (product_id, low_fats, recyclable) values ('1', 'Y', 'Y')
insert into Products (product_id, low_fats, recyclable) values ('2', 'N', 'Y')
insert into Products (product_id, low_fats, recyclable) values ('3', 'Y', 'Y')
insert into Products (product_id, low_fats, recyclable) values ('4', 'N', 'N')

In [7]:
schema = "product_id int, low_fats ENUM('Y', 'N'), recyclable ENUM('Y', 'N')"
data = [("0", "Y", "N"), ("1", "Y", "Y"), ("2", "N", "Y"), ("3", "Y", "Y"), ("4", "N", "N")]

insert_data_to_table("Leetcode_Q_1757", "Products", schema, data)

In [8]:
print (table_names('Leetcode_Q_1757'))

  TABLE_NAME
0   Products

/tmp/ipykernel_4978/1508427792.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql_query(query, con)

In [9]:
con = connector('Leetcode_Q_1757')

In [18]:
pd.read_sql("SELECT *\
            FROM Products p", con)

/tmp/ipykernel_4978/1206303508.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT *\

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [6]:
pd.read_sql("SELECT p.product_id\
            FROM Products p\
            WHERE low_fats = 'Y' AND recyclable = 'Y'", con)

   product_id
0           1
1           3

# Leetcode Question 1378: Replace Employee ID With The Unique Identifier

In [ ]:
Create table If Not Exists Employees (id int, name varchar(20))
Create table If Not Exists EmployeeUNI (id int, unique_id int)
Truncate table Employees
insert into Employees (id, name) values ('1', 'Alice')
insert into Employees (id, name) values ('7', 'Bob')
insert into Employees (id, name) values ('11', 'Meir')
insert into Employees (id, name) values ('90', 'Winston')
insert into Employees (id, name) values ('3', 'Jonathan')
Truncate table EmployeeUNI
insert into EmployeeUNI (id, unique_id) values ('3', '1')
insert into EmployeeUNI (id, unique_id) values ('11', '2')
insert into EmployeeUNI (id, unique_id) values ('90', '3')

In [36]:
database_creator('Leetcode_Q_1378')

In [37]:
schema = "id int, name varchar(20)"
data = [('1', 'Alice'), ('7', 'Bob'), ('11', 'Meir'), ('90', 'Winston'), ('3', 'Jonathan')]

insert_data_to_table("Leetcode_Q_1378", "Employees", schema, data)

In [38]:
schema = "id int, unique_id int"
data = [('3', '1'), ('11', '2'), ('90', '3')]

insert_data_to_table("Leetcode_Q_1378", "EmployeeUNI", schema, data)

In [39]:
print (table_names('Leetcode_Q_1378'))

    TABLE_NAME
0  EmployeeUNI
1    Employees

/tmp/ipykernel_4978/1508427792.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql_query(query, con)

In [27]:
con = connector('Leetcode_Q_1378')
pd.read_sql("SELECT *\
            FROM Employees", con)

/tmp/ipykernel_4978/2410596588.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT *\

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [28]:
pd.read_sql("SELECT *\
            FROM EmployeeUNI", con)

/tmp/ipykernel_4978/2989114297.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT *\

   id  unique_id
0   3          1
1  11          2
2  90          3

In [49]:
pd.read_sql("""
SELECT 
    euni.unique_id, 
    e.name
FROM Employees e
LEFT JOIN EmployeeUNI euni
    USING (id)
""", con)

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

# Leetcode Question 1683: Invalid Tweets

In [ ]:
Create table If Not Exists Tweets(tweet_id int, content varchar(50))
Truncate table Tweets
insert into Tweets (tweet_id, content) values ('1', 'Vote for Biden')
insert into Tweets (tweet_id, content) values ('2', 'Let us make America great again!')

In [59]:
database_creator('Leetcode_Q_1683')

In [60]:
schema = "tweet_id int, content varchar(50)"
data = [('1', "Vote for Biden"), ('2', "Let us make America great again!")]

insert_data_to_table("Leetcode_Q_1683", "Tweets", schema, data)

In [61]:
print(table_names('Leetcode_Q_1683'))

  TABLE_NAME
0     Tweets

/tmp/ipykernel_4978/1508427792.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql_query(query, con)

In [65]:
con = connector('Leetcode_Q_1683')

In [10]:
pd.read_sql("""
SELECT *
FROM Tweets
""", con)

   tweet_id                           content
0         1                    Vote for Biden
1         2  Let us make America great again!

In [15]:
pd.read_sql("""
SELECT tweet_id
FROM Tweets
WHERE LENGTH(content) > 15
""", con)

   tweet_id
0         2

# Leetcode Question 1741: Find Total Time Spent by Each Employee

In [ ]:
Create table If Not Exists Employees(emp_id int, event_day date, in_time int, out_time int)
Truncate table Employees
insert into Employees (emp_id, event_day, in_time, out_time) values ('1', '2020-11-28', '4', '32')
insert into Employees (emp_id, event_day, in_time, out_time) values ('1', '2020-11-28', '55', '200')
insert into Employees (emp_id, event_day, in_time, out_time) values ('1', '2020-12-3', '1', '42')
insert into Employees (emp_id, event_day, in_time, out_time) values ('2', '2020-11-28', '3', '33')
insert into Employees (emp_id, event_day, in_time, out_time) values ('2', '2020-12-9', '47', '74')

In [69]:
database_creator('Leetcode_Q_1741')

In [70]:
schema = "emp_id int, event_day date, in_time int, out_time int"
data = [('1', '2020-11-28', '4', '32'), ('1', '2020-11-28', '55', '200'), ('1', '2020-12-3', '1', '42'),
       ('2', '2020-11-28', '3', '33'), ('2', '2020-12-9', '47', '74')]

insert_data_to_table("Leetcode_Q_1741", "Employees", schema, data)

In [71]:
print(table_names('Leetcode_Q_1741'))

  TABLE_NAME
0  Employees

/tmp/ipykernel_4978/1508427792.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql_query(query, con)

In [79]:
con = connector('Leetcode_Q_1741')

In [80]:
#
pd.read_sql("""
SELECT *
FROM Employees
""", con)

/tmp/ipykernel_4978/4071364629.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   emp_id   event_day  in_time  out_time
0       1  2020-11-28        4        32
1       1  2020-11-28       55       200
2       1  2020-12-03        1        42
3       2  2020-11-28        3        33
4       2  2020-12-09       47        74

In [21]:
pd.read_sql("""
SELECT *
FROM Employees
""", con)

   emp_id   event_day  in_time  out_time
0       1  2020-11-28        4        32
1       1  2020-11-28       55       200
2       1  2020-12-03        1        42
3       2  2020-11-28        3        33
4       2  2020-12-09       47        74

In [30]:
pd.read_sql("""
SELECT 
    event_day AS day,
    emp_id, 
    SUM(out_time - in_time) AS total_time
FROM Employees
GROUP BY event_day, emp_id
ORDER BY event_day
""", con)

          day  emp_id  total_time
0  2020-11-28       1       173.0
1  2020-11-28       2        30.0
2  2020-12-03       1        41.0
3  2020-12-09       2        27.0

# Leetcode Question 2356: Number of Unique Subjects Taught by Each Teacher

In [ ]:
Create table If Not Exists Teacher (teacher_id int, subject_id int, dept_id int)
Truncate table Teacher
insert into Teacher (teacher_id, subject_id, dept_id) values ('1', '2', '3')
insert into Teacher (teacher_id, subject_id, dept_id) values ('1', '2', '4')
insert into Teacher (teacher_id, subject_id, dept_id) values ('1', '3', '3')
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '1', '1')
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '2', '1')
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '3', '1')
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '4', '1')

In [5]:
database_creator('Leetcode_Q_2356')

In [6]:
schema = "teacher_id int, subject_id int, dept_id int"
data = [('1', '2', '3'),
       ('1', '2', '4'),
       ('1', '3', '3'),
       ('2', '1', '1'),
       ('2', '2', '1'),
       ('2', '3', '1'),
       ('2', '4', '1')]

insert_data_to_table("Leetcode_Q_2356", "Teacher", schema, data)

In [7]:
con = connector('Leetcode_Q_2356')

In [34]:
pd.read_sql("""
SELECT *
FROM Teacher
""", con)

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

In [57]:
pd.read_sql("""
SELECT 
    teacher_id,
    COUNT(DISTINCT subject_id) AS cnt
FROM Teacher
GROUP BY teacher_id
""", con)

   teacher_id  cnt
0           1    2
1           2    4

# Leetcode Question 1693: Daily Leads and Partners

In [ ]:
Create table If Not Exists DailySales(date_id date, make_name varchar(20), lead_id int, partner_id int)
Truncate table DailySales
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'toyota', '0', '1')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'toyota', '1', '0')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'toyota', '1', '2')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'toyota', '0', '2')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'toyota', '0', '1')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'honda', '1', '2')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'honda', '2', '1')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'honda', '0', '1')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'honda', '1', '2')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'honda', '2', '1')

In [8]:
database_creator('Leetcode_Q_1693')

In [9]:
schema = "date_id date, make_name varchar(20), lead_id int, partner_id int"
data = [ ('2020-12-8', 'toyota', '0', '1'),
         ('2020-12-8', 'toyota', '1', '0'), 
         ('2020-12-8', 'toyota', '1', '2'), 
         ('2020-12-7', 'toyota', '0', '2'),
         ('2020-12-7', 'toyota', '0', '1'),
         ('2020-12-8', 'honda', '1', '2'),
         ('2020-12-8', 'honda', '2', '1'),
         ('2020-12-7', 'honda', '0', '1'),
         ('2020-12-7', 'honda', '1', '2'),
         ('2020-12-7', 'honda', '2', '1')]

insert_data_to_table("Leetcode_Q_1693", "DailySales", schema, data)

In [10]:
con = connector('Leetcode_Q_1693')

In [62]:
pd.read_sql("""
SELECT *
FROM DailySales
""", con)

      date_id make_name  lead_id  partner_id
0  2020-12-08    toyota        0           1
1  2020-12-08    toyota        1           0
2  2020-12-08    toyota        1           2
3  2020-12-07    toyota        0           2
4  2020-12-07    toyota        0           1
5  2020-12-08     honda        1           2
6  2020-12-08     honda        2           1
7  2020-12-07     honda        0           1
8  2020-12-07     honda        1           2
9  2020-12-07     honda        2           1

In [87]:
pd.read_sql("""
SELECT 
    date_id,
    make_name,
    COUNT(DISTINCT lead_id) AS unique_leads,
    COUNT(DISTINCT partner_id) AS unique_partners
FROM DailySales
GROUP BY date_id, make_name
ORDER BY make_name DESC, date_id DESC
""", con)

      date_id make_name  unique_leads  unique_partners
0  2020-12-08    toyota             2                3
1  2020-12-07    toyota             1                2
2  2020-12-08     honda             2                2
3  2020-12-07     honda             3                2

# Leetcode Question 1795: Rearrange Products Table

In [ ]:
Create table If Not Exists Products (product_id int, store1 int, store2 int, store3 int)
Truncate table Products
insert into Products (product_id, store1, store2, store3) values ('0', '95', '100', '105')
insert into Products (product_id, store1, store2, store3) values ('1', '70', 'None', '80')

In [12]:
database_creator('Leetcode_Q_1795')

In [13]:
schema = "product_id int, store1 int, store2 int, store3 int"
data = [ ('0', '95', '100', '105'),
       ('1', '70', None, '80')]

insert_data_to_table("Leetcode_Q_1795", "Products", schema, data)

In [14]:
con = connector('Leetcode_Q_1795')

In [10]:
pd.read_sql("""
SELECT *
FROM Products
""", con)

   product_id  store1  store2  store3
0           0      95   100.0     105
1           1      70     NaN      80

In [15]:
pd.read_sql("""
SELECT
    product_id,
    'store1' AS 'store',
    store1 AS price
FROM Products
WHERE store1 is NOT NULL
UNION
SELECT
    product_id,
    'store2' AS 'store',
    store2 AS price
FROM Products
WHERE store2 is NOT NULL
UNION
SELECT
    product_id,
    'store3' AS 'store',
    store3 AS price
FROM Products
WHERE store3 is NOT NULL
ORDER BY product_id
""", con)

/tmp/ipykernel_4765/2681703108.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   product_id   store  price
0           0  store1     95
1           0  store2    100
2           0  store3    105
3           1  store1     70
4           1  store3     80

# Leetcode Question 1587: Bank Account Summary II

In [ ]:
Create table If Not Exists Users (account int, name varchar(20))
Create table If Not Exists Transactions (trans_id int, account int, amount int, transacted_on date)
Truncate table Users
insert into Users (account, name) values ('900001', 'Alice')
insert into Users (account, name) values ('900002', 'Bob')
insert into Users (account, name) values ('900003', 'Charlie')
Truncate table Transactions
insert into Transactions (trans_id, account, amount, transacted_on) values ('1', '900001', '7000', '2020-08-01')
insert into Transactions (trans_id, account, amount, transacted_on) values ('2', '900001', '7000', '2020-09-01')
insert into Transactions (trans_id, account, amount, transacted_on) values ('3', '900001', '-3000', '2020-09-02')
insert into Transactions (trans_id, account, amount, transacted_on) values ('4', '900002', '1000', '2020-09-12')
insert into Transactions (trans_id, account, amount, transacted_on) values ('5', '900003', '6000', '2020-08-07')
insert into Transactions (trans_id, account, amount, transacted_on) values ('6', '900003', '6000', '2020-09-07')
insert into Transactions (trans_id, account, amount, transacted_on) values ('7', '900003', '-4000', '2020-09-11')

In [17]:
database_creator('Leetcode_Q_1587')

In [18]:
schema = "account int, name varchar(20)"
data = [ ('900001', 'Alice'),
       ('900002', 'Bob'),
       ('900003', 'Charlie')]

insert_data_to_table("Leetcode_Q_1587", "Users", schema, data)

In [19]:
schema = "trans_id int, account int, amount int, transacted_on date"
data = [ ('1', '900001', '7000', '2020-08-01'),
       ('2', '900001', '7000', '2020-09-01'),
       ('3', '900001', '-3000', '2020-09-02'),
       ('4', '900002', '1000', '2020-09-12'),
       ('5', '900003', '6000', '2020-08-07'),
       ('6', '900003', '6000', '2020-09-07'),
       ('7', '900003', '-4000', '2020-09-11')]

insert_data_to_table("Leetcode_Q_1587", "Transactions", schema, data)

In [20]:
con = connector('Leetcode_Q_1587')

In [9]:
table_names('Leetcode_Q_1587')

     TABLE_NAME
0  Transactions
1         Users

In [10]:
pd.read_sql("""
SELECT *
FROM Users
""", con)

   account     name
0   900001    Alice
1   900002      Bob
2   900003  Charlie

In [11]:
pd.read_sql("""
SELECT *
FROM Transactions
""", con)

   trans_id  account  amount transacted_on
0         1   900001    7000    2020-08-01
1         2   900001    7000    2020-09-01
2         3   900001   -3000    2020-09-02
3         4   900002    1000    2020-09-12
4         5   900003    6000    2020-08-07
5         6   900003    6000    2020-09-07
6         7   900003   -4000    2020-09-11

In [16]:
pd.read_sql("""
SELECT 
    name,
    SUM(amount) AS balance

FROM Users
JOIN Transactions USING (account)
GROUP BY name
HAVING balance > 10000
""", con)

    name  balance
0  Alice  11000.0

# Leetcode Question 1581: Customer Who Visited but Did Not Make Any Transactions

In [ ]:
Create table If Not Exists Visits(visit_id int, customer_id int)
Create table If Not Exists Transactions(transaction_id int, visit_id int, amount int)
Truncate table Visits
insert into Visits (visit_id, customer_id) values ('1', '23')
insert into Visits (visit_id, customer_id) values ('2', '9')
insert into Visits (visit_id, customer_id) values ('4', '30')
insert into Visits (visit_id, customer_id) values ('5', '54')
insert into Visits (visit_id, customer_id) values ('6', '96')
insert into Visits (visit_id, customer_id) values ('7', '54')
insert into Visits (visit_id, customer_id) values ('8', '54')
Truncate table Transactions
insert into Transactions (transaction_id, visit_id, amount) values ('2', '5', '310')
insert into Transactions (transaction_id, visit_id, amount) values ('3', '5', '300')
insert into Transactions (transaction_id, visit_id, amount) values ('9', '5', '200')
insert into Transactions (transaction_id, visit_id, amount) values ('12', '1', '910')
insert into Transactions (transaction_id, visit_id, amount) values ('13', '2', '970')

In [21]:
database_creator('Leetcode_Q_1581')

In [22]:
schema = "visit_id int, customer_id int"
data = [ ('1', '23'),
       ('2', '9'),
       ('4', '30'),
       ('5', '54'),
       ('6', '96'),
       ('7', '54'),
       ('8', '54')]

insert_data_to_table("Leetcode_Q_1581", "Visits", schema, data)

In [23]:
schema = "transaction_id int, visit_id int, amount int"
data = [ ('2', '5', '310'),
       ('3', '5', '300'),
       ('9', '5', '200'),
       ('12', '1', '910'),
       ('13', '2', '970')]

insert_data_to_table("Leetcode_Q_1581", "Transactions", schema, data)

In [24]:
table_names('Leetcode_Q_1581')

/tmp/ipykernel_4765/1508427792.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql_query(query, con)

     TABLE_NAME
0  Transactions
1        Visits

In [25]:
con = connector('Leetcode_Q_1581')

In [33]:
pd.read_sql("""
SELECT *
FROM Transactions""", con)

   transaction_id  visit_id  amount
0               2         5     310
1               3         5     300
2               9         5     200
3              12         1     910
4              13         2     970

In [34]:
pd.read_sql("""
SELECT *
FROM Visits""", con)

   visit_id  customer_id
0         1           23
1         2            9
2         4           30
3         5           54
4         6           96
5         7           54
6         8           54

In [70]:
pd.read_sql("""
SELECT 
    customer_id,
    COUNT(*) AS count_no_trans
FROM Visits 
LEFT JOIN Transactions USING (visit_id)
WHERE transaction_id IS NULL
GROUP BY customer_id  
ORDER BY COUNT(*) DESC
""", con)

   customer_id  count_no_trans
0           54               2
1           30               1
2           96               1

# Leetcode Question 627: Swap Salary

In [ ]:
Create table If Not Exists Salary (id int, name varchar(100), sex char(1), salary int)
Truncate table Salary
insert into Salary (id, name, sex, salary) values ('1', 'A', 'm', '2500')
insert into Salary (id, name, sex, salary) values ('2', 'B', 'f', '1500')
insert into Salary (id, name, sex, salary) values ('3', 'C', 'm', '5500')
insert into Salary (id, name, sex, salary) values ('4', 'D', 'f', '500')

In [26]:
database_creator('Leetcode_Q_627')

In [27]:
schema = "id int, name varchar(100), sex char(1), salary int"
data = [('1', 'A', 'm', '2500'),
       ('2', 'B', 'f', '1500'),
       ('3', 'C', 'm', '5500'),
       ('4', 'D', 'f', '500')]

insert_data_to_table("Leetcode_Q_627", "Salary", schema, data)

In [28]:
con = connector('Leetcode_Q_627')

In [6]:
pd.read_sql("""
SELECT *
FROM Salary
""", con)

   id name sex  salary
0   1    A   m    2500
1   2    B   f    1500
2   3    C   m    5500
3   4    D   f     500

In [7]:
cursor = con.cursor()

cursor.execute("""
UPDATE Salary
SET sex = CASE
            WHEN sex = 'f' THEN 'm'
            WHEN sex = 'm' THEN 'f'
            END
""")

con.commit()

In [8]:
pd.read_sql("""
SELECT *
FROM Salary
""", con)

   id name sex  salary
0   1    A   f    2500
1   2    B   m    1500
2   3    C   f    5500
3   4    D   m     500

# Leetcode Question 1251. Average Selling Price

In [ ]:
Create table If Not Exists Prices (product_id int, start_date date, end_date date, price int)
Create table If Not Exists UnitsSold (product_id int, purchase_date date, units int)
Truncate table Prices
insert into Prices (product_id, start_date, end_date, price) values ('1', '2019-02-17', '2019-02-28', '5')
insert into Prices (product_id, start_date, end_date, price) values ('1', '2019-03-01', '2019-03-22', '20')
insert into Prices (product_id, start_date, end_date, price) values ('2', '2019-02-01', '2019-02-20', '15')
insert into Prices (product_id, start_date, end_date, price) values ('2', '2019-02-21', '2019-03-31', '30')
Truncate table UnitsSold
insert into UnitsSold (product_id, purchase_date, units) values ('1', '2019-02-25', '100')
insert into UnitsSold (product_id, purchase_date, units) values ('1', '2019-03-01', '15')
insert into UnitsSold (product_id, purchase_date, units) values ('2', '2019-02-10', '200')
insert into UnitsSold (product_id, purchase_date, units) values ('2', '2019-03-22', '30')

In [30]:
database_creator('Leetcode_Q_1251')

In [31]:
schema = "product_id int, start_date date, end_date date, price int"
data = [ ('1', '2019-02-17', '2019-02-28', '5'),
       ('1', '2019-03-01', '2019-03-22', '20'),
       ('2', '2019-02-01', '2019-02-20', '15'),
       ('2', '2019-02-21', '2019-03-31', '30')]

insert_data_to_table("Leetcode_Q_1251", "Prices", schema, data)

In [32]:
schema = "product_id int, purchase_date date, units int"
data = [ ('1', '2019-02-25', '100'),
       ('1', '2019-03-01', '15'),
       ('2', '2019-02-10', '200'),
       ('2', '2019-03-22', '30')]

insert_data_to_table("Leetcode_Q_1251", "UnitsSold", schema, data)

In [33]:
con = connector('Leetcode_Q_1251')

In [6]:
pd.read_sql("""
SELECT *
FROM Prices
""", con)

   product_id  start_date    end_date  price
0           1  2019-02-17  2019-02-28      5
1           1  2019-03-01  2019-03-22     20
2           2  2019-02-01  2019-02-20     15
3           2  2019-02-21  2019-03-31     30

In [7]:
pd.read_sql("""
SELECT *
FROM UnitsSold
""", con)

   product_id purchase_date  units
0           1    2019-02-25    100
1           1    2019-03-01     15
2           2    2019-02-10    200
3           2    2019-03-22     30

In [13]:
pd.read_sql("""
SELECT *
FROM Prices p 
JOIN UnitsSold u
    ON u.purchase_date BETWEEN p.start_date AND p.end_date AND p.product_id = u.product_id
    
""", con)

   product_id  start_date    end_date  price  product_id purchase_date  units
0           1  2019-02-17  2019-02-28      5           1    2019-02-25    100
1           1  2019-03-01  2019-03-22     20           1    2019-03-01     15
2           2  2019-02-01  2019-02-20     15           2    2019-02-10    200
3           2  2019-02-21  2019-03-31     30           2    2019-03-22     30

In [31]:
pd.read_sql("""
SELECT 
    p.product_id,
    ROUND (SUM(p.price * u.units) / SUM(units), 2) AS average_price
FROM Prices p 
JOIN UnitsSold u
    ON u.purchase_date BETWEEN p.start_date AND p.end_date AND p.product_id = u.product_id
GROUP BY product_id
""", con)

   product_id  average_price
0           1           6.96
1           2          16.96

# Leetcode Question 1068: Product Sales Analysis I

In [ ]:
Create table If Not Exists Sales (sale_id int, product_id int, year int, quantity int, price int)
Create table If Not Exists Product (product_id int, product_name varchar(10))
Truncate table Sales
insert into Sales (sale_id, product_id, year, quantity, price) values ('1', '100', '2008', '10', '5000')
insert into Sales (sale_id, product_id, year, quantity, price) values ('2', '100', '2009', '12', '5000')
insert into Sales (sale_id, product_id, year, quantity, price) values ('7', '200', '2011', '15', '9000')
Truncate table Product
insert into Product (product_id, product_name) values ('100', 'Nokia')
insert into Product (product_id, product_name) values ('200', 'Apple')
insert into Product (product_id, product_name) values ('300', 'Samsung')

In [34]:
database_creator('Leetcode_Q_1068')

In [35]:
schema = "sale_id int, product_id int, year int, quantity int, price int"
data = [ ('1', '100', '2008', '10', '5000'),
       ('2', '100', '2009', '12', '5000'),
       ('7', '200', '2011', '15', '9000')]

insert_data_to_table("Leetcode_Q_1068", "Sales", schema, data)

In [36]:
schema = "product_id int, product_name varchar(10)"
data = [('100', 'Nokia'),
       ('200', 'Apple'),
       ('300', 'Samsung')]

insert_data_to_table("Leetcode_Q_1068", "Product", schema, data)

In [37]:
con = connector("Leetcode_Q_1068")

In [34]:
pd.read_sql("""
SELECT *
FROM Sales
""", con)

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [35]:
pd.read_sql("""
SELECT *
FROM Product
""", con)

   product_id product_name
0         100        Nokia
1         200        Apple
2         300      Samsung

In [39]:
pd.read_sql("""
SELECT 
    p.product_name,
    s.year,
    s.price
FROM Sales s
JOIN Product p
    USING (product_id)
ORDER BY s.year
""", con)

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

# Leetcode Question 1179: Reformat Department Table

In [ ]:
Create table If Not Exists Department (id int, revenue int, month varchar(5))
Truncate table Department
insert into Department (id, revenue, month) values ('1', '8000', 'Jan')
insert into Department (id, revenue, month) values ('2', '9000', 'Jan')
insert into Department (id, revenue, month) values ('3', '10000', 'Feb')
insert into Department (id, revenue, month) values ('1', '7000', 'Feb')
insert into Department (id, revenue, month) values ('1', '6000', 'Mar')

In [38]:
database_creator('Leetcode_Q_1179')

In [39]:
schema = "id int, revenue int, month varchar(5)"
data = [('1', '8000', 'Jan'),
       ('2', '9000', 'Jan'),
       ('3', '10000', 'Feb'),
       ('1', '7000', 'Feb'),
       ('1', '6000', 'Mar')]

insert_data_to_table("Leetcode_Q_1179", "Department", schema, data)

In [40]:
con = connector('Leetcode_Q_1179')

In [42]:
table_names('Leetcode_Q_1179')

/tmp/ipykernel_4765/1508427792.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql_query(query, con)

   TABLE_NAME
0  Department

In [41]:
pd.read_sql("""
SELECT *
FROM Department
""", con)

/tmp/ipykernel_4765/424209266.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   id  revenue month
0   1     8000   Jan
1   2     9000   Jan
2   3    10000   Feb
3   1     7000   Feb
4   1     6000   Mar

In [59]:
pd.read_sql("""

SELECT 
    id,
    SUM(CASE WHEN month = 'Jan' THEN revenue ELSE NULL END) AS Jan_Revenue,
    SUM(CASE WHEN month = 'Feb' THEN revenue ELSE NULL END) AS Feb_Revenue,
    SUM(CASE WHEN month = 'Mar' THEN revenue ELSE NULL END) AS Mar_Revenue,
    SUM(CASE WHEN month = 'Apr' THEN revenue ELSE NULL END) AS Apr_Revenue,
    SUM(CASE WHEN month = 'May' THEN revenue ELSE NULL END) AS May_Revenue,
    SUM(CASE WHEN month = 'Jun' THEN revenue ELSE NULL END) AS Jun_Revenue,
    SUM(CASE WHEN month = 'Jul' THEN revenue ELSE NULL END) AS Jul_Revenue,
    SUM(CASE WHEN month = 'Aug' THEN revenue ELSE NULL END) AS Aug_Revenue,
    SUM(CASE WHEN month = 'Sep' THEN revenue ELSE NULL END) AS Sep_Revenue,
    SUM(CASE WHEN month = 'Oct' THEN revenue ELSE NULL END) AS Oct_Revenue,
    SUM(CASE WHEN month = 'Nov' THEN revenue ELSE NULL END) AS Nov_Revenue,
    SUM(CASE WHEN month = 'Dec' THEN revenue ELSE NULL END) AS Dec_Revenue
FROM Department
GROUP BY id
""", con)

/tmp/ipykernel_4765/1103765812.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

,id,Jan_Revenue,Feb_Revenue,Mar_Revenue,Apr_Revenue,May_Revenue,Jun_Revenue,Jul_Revenue,Aug_Revenue,Sep_Revenue,Oct_Revenue,Nov_Revenue,Dec_Revenue
0,1,8000.0,7000.0,6000.0,None,None,None,None,None,None,None,None,None
1,2,9000.0,NaN,NaN,None,None,None,None,None,None,None,None,None
2,3,NaN,10000.0,NaN,None,None,None,None,None,None,None,None,None

# Leetcode Question 1484: Group Sold Products By The Date

In [ ]:
Create table If Not Exists Activities (sell_date date, product varchar(20))
Truncate table Activities
insert into Activities (sell_date, product) values ('2020-05-30', 'Headphone')
insert into Activities (sell_date, product) values ('2020-06-01', 'Pencil')
insert into Activities (sell_date, product) values ('2020-06-02', 'Mask')
insert into Activities (sell_date, product) values ('2020-05-30', 'Basketball')
insert into Activities (sell_date, product) values ('2020-06-01', 'Bible')
insert into Activities (sell_date, product) values ('2020-06-02', 'Mask')
insert into Activities (sell_date, product) values ('2020-05-30', 'T-Shirt')

In [60]:
database_creator('Leetcode_Q_1484')

In [61]:
schema = "sell_date date, product varchar(20)"
data = [ ('2020-05-30', 'Headphone'),
       ('2020-06-01', 'Pencil'),
       ('2020-06-02', 'Mask'),
       ('2020-05-30', 'Basketball'),
       ('2020-06-01', 'Bible'),
       ('2020-06-02', 'Mask'),
       ('2020-05-30', 'T-Shirt')]

insert_data_to_table("Leetcode_Q_1484", "Activities", schema, data)

In [62]:
con = connector('Leetcode_Q_1484')

In [63]:
pd.read_sql("""
SELECT *
FROM Activities
""", con)

/tmp/ipykernel_4765/4167715436.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

    sell_date     product
0  2020-05-30   Headphone
1  2020-06-01      Pencil
2  2020-06-02        Mask
3  2020-05-30  Basketball
4  2020-06-01       Bible
5  2020-06-02        Mask
6  2020-05-30     T-Shirt

In [76]:
pd.read_sql("""
SELECT 
    sell_date,
    COUNT(DISTINCT product) AS num_sold,
    GROUP_CONCAT(DISTINCT product) AS products
FROM Activities
GROUP BY sell_date
ORDER BY sell_date
""", con)

/tmp/ipykernel_4765/1548185594.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

    sell_date  num_sold                      products
0  2020-05-30         3  Basketball,Headphone,T-Shirt
1  2020-06-01         2                  Bible,Pencil
2  2020-06-02         1                          Mask

# Leetcode Question 1890: The Latest Login in 2020

In [ ]:
Create table If Not Exists Logins (user_id int, time_stamp datetime)
Truncate table Logins
insert into Logins (user_id, time_stamp) values ('6', '2020-06-30 15:06:07')
insert into Logins (user_id, time_stamp) values ('6', '2021-04-21 14:06:06')
insert into Logins (user_id, time_stamp) values ('6', '2019-03-07 00:18:15')
insert into Logins (user_id, time_stamp) values ('8', '2020-02-01 05:10:53')
insert into Logins (user_id, time_stamp) values ('8', '2020-12-30 00:46:50')
insert into Logins (user_id, time_stamp) values ('2', '2020-01-16 02:49:50')
insert into Logins (user_id, time_stamp) values ('2', '2019-08-25 07:59:08')
insert into Logins (user_id, time_stamp) values ('14', '2019-07-14 09:00:00')
insert into Logins (user_id, time_stamp) values ('14', '2021-01-06 11:59:59')

In [77]:
database_creator('Leetcode_Q_1890')

In [78]:
schema = "user_id int, time_stamp datetime"
data = [ ('6', '2020-06-30 15:06:07'),
       ('6', '2021-04-21 14:06:06'),
       ('6', '2019-03-07 00:18:15'),
       ('8', '2020-02-01 05:10:53'),
       ('8', '2020-12-30 00:46:50'),
       ('2', '2020-01-16 02:49:50'),
       ('2', '2019-08-25 07:59:08'),
       ('14', '2019-07-14 09:00:00'),
       ('14', '2021-01-06 11:59:59')]

insert_data_to_table("Leetcode_Q_1890", "Logins", schema, data)

In [79]:
con = connector('Leetcode_Q_1890')

In [55]:
pd.read_sql("""
SELECT *
FROM Logins
""", con)

   user_id          time_stamp
0        6 2020-06-30 15:06:07
1        6 2021-04-21 14:06:06
2        6 2019-03-07 00:18:15
3        8 2020-02-01 05:10:53
4        8 2020-12-30 00:46:50
5        2 2020-01-16 02:49:50
6        2 2019-08-25 07:59:08
7       14 2019-07-14 09:00:00
8       14 2021-01-06 11:59:59

In [66]:
pd.read_sql("""
SELECT 
    user_id,
    MAX(time_stamp) AS last_stamp
FROM Logins
WHERE YEAR(time_stamp) = 2020
GROUP BY user_id
""", con)

   user_id          last_stamp
0        6 2020-06-30 15:06:07
1        8 2020-12-30 00:46:50
2        2 2020-01-16 02:49:50

# Leetcode Question 1789: Primary Department for Each Employee

In [ ]:
Create table If Not Exists Employee (employee_id int, department_id int, primary_flag ENUM('Y','N'))
Truncate table Employee
insert into Employee (employee_id, department_id, primary_flag) values ('1', '1', 'N')
insert into Employee (employee_id, department_id, primary_flag) values ('2', '1', 'Y')
insert into Employee (employee_id, department_id, primary_flag) values ('2', '2', 'N')
insert into Employee (employee_id, department_id, primary_flag) values ('3', '3', 'N')
insert into Employee (employee_id, department_id, primary_flag) values ('4', '2', 'N')
insert into Employee (employee_id, department_id, primary_flag) values ('4', '3', 'Y')
insert into Employee (employee_id, department_id, primary_flag) values ('4', '4', 'N')

In [80]:
database_creator('Leetcode_Q_1789')

In [81]:
schema = "employee_id int, department_id int, primary_flag ENUM('Y','N')"
data = [ ('1', '1', 'N'),
       ('2', '1', 'Y'),
       ('2', '2', 'N'),
       ('3', '3', 'N'),
       ('4', '2', 'N'),
       ('4', '3', 'Y'),
       ('4', '4', 'N')]

insert_data_to_table("Leetcode_Q_1789", "Employee", schema, data)

In [82]:
con = connector('Leetcode_Q_1789')

In [83]:
pd.read_sql("""
SELECT *
FROM Employee
""", con)

/tmp/ipykernel_4765/3389445133.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   employee_id  department_id primary_flag
0            1              1            N
1            2              1            Y
2            2              2            N
3            3              3            N
4            4              2            N
5            4              3            Y
6            4              4            N

In [98]:
pd.read_sql("""
SELECT 
    employee_id, 
    COALESCE (MAX(CASE WHEN primary_flag = 'Y' THEN department_id END), MAX(department_id))  AS department_id
FROM Employee
GROUP BY employee_id
""", con)

/tmp/ipykernel_4765/3899898494.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   employee_id  department_id
0            1              1
1            2              1
2            3              3
3            4              3

# Leetcode Question 1661: Average Time of Process per Machine

In [ ]:
Create table If Not Exists Activity (machine_id int, process_id int, activity_type ENUM('start', 'end'), timestamp float)
Truncate table Activity
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('0', '0', 'start', '0.712')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('0', '0', 'end', '1.52')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('0', '1', 'start', '3.14')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('0', '1', 'end', '4.12')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('1', '0', 'start', '0.55')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('1', '0', 'end', '1.55')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('1', '1', 'start', '0.43')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('1', '1', 'end', '1.42')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('2', '0', 'start', '4.1')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('2', '0', 'end', '4.512')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('2', '1', 'start', '2.5')
insert into Activity (machine_id, process_id, activity_type, timestamp) values ('2', '1', 'end', '5')

In [100]:
database_creator('Leetcode_Q_1661')

In [101]:
schema = "machine_id int, process_id int, activity_type ENUM('start', 'end'), timestamp float"
data = [ ('0', '0', 'start', '0.712'),
       ('0', '0', 'end', '1.52'),
       ('0', '1', 'start', '3.14'),
       ('0', '1', 'end', '4.12'),
       ('1', '0', 'start', '0.55'),
       ('1', '0', 'end', '1.55'),
       ('1', '1', 'start', '0.43'),
       ('1', '1', 'end', '1.42'),
       ('2', '0', 'start', '4.1'),
       ('2', '0', 'end', '4.512'),
       ('2', '1', 'start', '2.5'),
       ('2', '1', 'end', '5')]

insert_data_to_table("Leetcode_Q_1661", "Activity", schema, data)

In [102]:
con = connector('Leetcode_Q_1661')

In [10]:
pd.read_sql("""
SELECT *
FROM Activity
""", con)

    machine_id  process_id activity_type  timestamp
0            0           0         start      0.712
1            0           0           end      1.520
2            0           1         start      3.140
3            0           1           end      4.120
4            1           0         start      0.550
5            1           0           end      1.550
6            1           1         start      0.430
7            1           1           end      1.420
8            2           0         start      4.100
9            2           0           end      4.512
10           2           1         start      2.500
11           2           1           end      5.000

In [37]:
pd.read_sql("""
SELECT 
    a.machine_id, ROUND(AVG(b.timestamp - a.timestamp), 3) AS processing_time
FROM Activity a
JOIN Activity b
    ON a.machine_id = b.machine_id AND
       a.process_id = b.process_id
WHERE a.activity_type = 'start' AND b.activity_type = 'end'
GROUP BY machine_id
""", con)

   machine_id  processing_time
0           0            0.894
1           1            0.995
2           2            1.456

# Leetcode Question 1148: Article Views I

In [ ]:
Create table If Not Exists Views (article_id int, author_id int, viewer_id int, view_date date)
Truncate table Views
insert into Views (article_id, author_id, viewer_id, view_date) values ('1', '3', '5', '2019-08-01')
insert into Views (article_id, author_id, viewer_id, view_date) values ('1', '3', '6', '2019-08-02')
insert into Views (article_id, author_id, viewer_id, view_date) values ('2', '7', '7', '2019-08-01')
insert into Views (article_id, author_id, viewer_id, view_date) values ('2', '7', '6', '2019-08-02')
insert into Views (article_id, author_id, viewer_id, view_date) values ('4', '7', '1', '2019-07-22')
insert into Views (article_id, author_id, viewer_id, view_date) values ('3', '4', '4', '2019-07-21')
insert into Views (article_id, author_id, viewer_id, view_date) values ('3', '4', '4', '2019-07-21')

In [118]:
database_creator('Leetcode_Q_1148')

In [119]:
schema = "article_id int, author_id int, viewer_id int, view_date date"
data = [('1', '3', '5', '2019-08-01'),
       ('1', '3', '6', '2019-08-02'),
       ('2', '7', '7', '2019-08-01'),
       ('2', '7', '6', '2019-08-02'),
       ('4', '7', '1', '2019-07-22'),
       ('3', '4', '4', '2019-07-21'),
       ('3', '4', '4', '2019-07-21')]

insert_data_to_table("Leetcode_Q_1148", "Views", schema, data)

In [120]:
con = connector('Leetcode_Q_1148')

In [121]:
pd.read_sql("""
SELECT *
FROM Views
""", con)

/tmp/ipykernel_4765/2494680256.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   article_id  author_id  viewer_id   view_date
0           1          3          5  2019-08-01
1           1          3          6  2019-08-02
2           2          7          7  2019-08-01
3           2          7          6  2019-08-02
4           4          7          1  2019-07-22
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21

In [55]:
pd.read_sql("""
SELECT DISTINCT author_id AS id
FROM Views 
WHERE author_id = viewer_id
ORDER BY author_id
""", con)

   id
0   4
1   7

# Leetcode Question 511: Game Play Analysis I

In [ ]:
Create table If Not Exists Activity (player_id int, device_id int, event_date date, games_played int)
Truncate table Activity
insert into Activity (player_id, device_id, event_date, games_played) values ('1', '2', '2016-03-01', '5')
insert into Activity (player_id, device_id, event_date, games_played) values ('1', '2', '2016-05-02', '6')
insert into Activity (player_id, device_id, event_date, games_played) values ('2', '3', '2017-06-25', '1')
insert into Activity (player_id, device_id, event_date, games_played) values ('3', '1', '2016-03-02', '0')
insert into Activity (player_id, device_id, event_date, games_played) values ('3', '4', '2018-07-03', '5')

In [132]:
database_creator('Leetcode_Q_511')

In [133]:
schema = "player_id int, device_id int, event_date date, games_played int"
data = [('1', '2', '2016-03-01', '5'),
       ('1', '2', '2016-05-02', '6'),
       ('2', '3', '2017-06-25', '1'),
       ('3', '1', '2016-03-02', '0'),
       ('3', '4', '2018-07-03', '5')]

insert_data_to_table("Leetcode_Q_511", "Activity", schema, data)

In [134]:
con = connector('Leetcode_Q_511')

In [135]:
pd.read_sql("""
SELECT *
FROM Activity
""", con)

/tmp/ipykernel_4765/987028561.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   player_id  device_id  event_date  games_played
0          1          2  2016-03-01             5
1          1          2  2016-05-02             6
2          2          3  2017-06-25             1
3          3          1  2016-03-02             0
4          3          4  2018-07-03             5

In [61]:
pd.read_sql("""
SELECT player_id, MIN(event_date) AS first_login
FROM Activity
GROUP BY player_id
""", con)

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02

# Leetcode Question 1327: List the Products Ordered in a Period

In [ ]:
Create table If Not Exists Products (product_id int, product_name varchar(40), product_category varchar(40))
Create table If Not Exists Orders (product_id int, order_date date, unit int)
Truncate table Products
insert into Products (product_id, product_name, product_category) values ('1', 'Leetcode Solutions', 'Book')
insert into Products (product_id, product_name, product_category) values ('2', 'Jewels of Stringology', 'Book')
insert into Products (product_id, product_name, product_category) values ('3', 'HP', 'Laptop')
insert into Products (product_id, product_name, product_category) values ('4', 'Lenovo', 'Laptop')
insert into Products (product_id, product_name, product_category) values ('5', 'Leetcode Kit', 'T-shirt')
Truncate table Orders
insert into Orders (product_id, order_date, unit) values ('1', '2020-02-05', '60')
insert into Orders (product_id, order_date, unit) values ('1', '2020-02-10', '70')
insert into Orders (product_id, order_date, unit) values ('2', '2020-01-18', '30')
insert into Orders (product_id, order_date, unit) values ('2', '2020-02-11', '80')
insert into Orders (product_id, order_date, unit) values ('3', '2020-02-17', '2')
insert into Orders (product_id, order_date, unit) values ('3', '2020-02-24', '3')
insert into Orders (product_id, order_date, unit) values ('4', '2020-03-01', '20')
insert into Orders (product_id, order_date, unit) values ('4', '2020-03-04', '30')
insert into Orders (product_id, order_date, unit) values ('4', '2020-03-04', '60')
insert into Orders (product_id, order_date, unit) values ('5', '2020-02-25', '50')
insert into Orders (product_id, order_date, unit) values ('5', '2020-02-27', '50')
insert into Orders (product_id, order_date, unit) values ('5', '2020-03-01', '50')

In [136]:
database_creator('Leetcode_Q_1327')

In [137]:
schema = "product_id int, product_name varchar(40), product_category varchar(40)"
data = [ ('1', 'Leetcode Solutions', 'Book'),
        ('2', 'Jewels of Stringology', 'Book'),
        ('3', 'HP', 'Laptop'),
        ('4', 'Lenovo', 'Laptop'),
        ('5', 'Leetcode Kit', 'T-shirt')]

insert_data_to_table("Leetcode_Q_1327", "Products", schema, data)

In [138]:
schema = "product_id int, order_date date, unit int"
data = [ ('1', '2020-02-05', '60'),
       ('1', '2020-02-10', '70'),
       ('2', '2020-01-18', '30'),
       ('2', '2020-02-11', '80'),
       ('3', '2020-02-17', '2'),
       ('3', '2020-02-24', '3'),
       ('4', '2020-03-01', '20'),
       ('4', '2020-03-04', '30'),
       ('4', '2020-03-04', '60'),
       ('5', '2020-02-25', '50'),
       ('5', '2020-02-27', '50'),
       ('5', '2020-03-01', '50')]

insert_data_to_table("Leetcode_Q_1327", "Orders", schema, data)

In [139]:
con = connector('Leetcode_Q_1327')

In [140]:
pd.read_sql("""
SELECT *
FROM Products
""", con)

/tmp/ipykernel_4765/926345996.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   product_id           product_name product_category
0           1     Leetcode Solutions             Book
1           2  Jewels of Stringology             Book
2           3                     HP           Laptop
3           4                 Lenovo           Laptop
4           5           Leetcode Kit          T-shirt

In [141]:
pd.read_sql("""
SELECT *
FROM Orders
""", con)

/tmp/ipykernel_4765/1418188007.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

    product_id  order_date  unit
0            1  2020-02-05    60
1            1  2020-02-10    70
2            2  2020-01-18    30
3            2  2020-02-11    80
4            3  2020-02-17     2
5            3  2020-02-24     3
6            4  2020-03-01    20
7            4  2020-03-04    30
8            4  2020-03-04    60
9            5  2020-02-25    50
10           5  2020-02-27    50
11           5  2020-03-01    50

In [68]:
pd.read_sql("""
SELECT *
FROM Products p
JOIN Orders o
    USING (product_id)

""", con)

    product_id           product_name product_category  order_date  unit
0            1     Leetcode Solutions             Book  2020-02-05    60
1            1     Leetcode Solutions             Book  2020-02-10    70
2            2  Jewels of Stringology             Book  2020-01-18    30
3            2  Jewels of Stringology             Book  2020-02-11    80
4            3                     HP           Laptop  2020-02-17     2
5            3                     HP           Laptop  2020-02-24     3
6            4                 Lenovo           Laptop  2020-03-01    20
7            4                 Lenovo           Laptop  2020-03-04    30
8            4                 Lenovo           Laptop  2020-03-04    60
9            5           Leetcode Kit          T-shirt  2020-02-25    50
10           5           Leetcode Kit          T-shirt  2020-02-27    50
11           5           Leetcode Kit          T-shirt  2020-03-01    50

In [92]:
pd.read_sql("""
SELECT product_name, SUM(unit) AS unit
FROM Products p
JOIN Orders o
    USING (product_id)
WHERE MONTH(order_date) = 2  
GROUP BY product_name
HAVING unit >= 100
""", con)

         product_name   unit
0  Leetcode Solutions  130.0
1        Leetcode Kit  100.0

# Leetcode Question 577: Employee Bonus

In [ ]:
Create table If Not Exists Employee (empId int, name varchar(255), supervisor int, salary int)
Create table If Not Exists Bonus (empId int, bonus int)
Truncate table Employee
insert into Employee (empId, name, supervisor, salary) values ('3', 'Brad', 'None', '4000')
insert into Employee (empId, name, supervisor, salary) values ('1', 'John', '3', '1000')
insert into Employee (empId, name, supervisor, salary) values ('2', 'Dan', '3', '2000')
insert into Employee (empId, name, supervisor, salary) values ('4', 'Thomas', '3', '4000')
Truncate table Bonus
insert into Bonus (empId, bonus) values ('2', '500')
insert into Bonus (empId, bonus) values ('4', '2000')

In [142]:
database_creator('Leetcode_Q_577')

In [143]:
schema = "empId int, name varchar(255), supervisor int, salary int"
data = [('3', 'Brad', None, '4000'),
       ('1', 'John', '3', '1000'),
       ('2', 'Dan', '3', '2000'),
       ('4', 'Thomas', '3', '4000')]

insert_data_to_table("Leetcode_Q_577", "Employee", schema, data)

In [144]:
schema = "empId int, bonus int"
data = [('2', '500'),
       ('4', '2000')]

insert_data_to_table("Leetcode_Q_577", "Bonus", schema, data)

In [145]:
con = connector('Leetcode_Q_577')

In [148]:
pd.read_sql("""
SELECT *
FROM Employee
""", con)

/tmp/ipykernel_4765/3389445133.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   empId    name  supervisor  salary
0      3    Brad         NaN    4000
1      1    John         3.0    1000
2      2     Dan         3.0    2000
3      4  Thomas         3.0    4000

In [149]:
pd.read_sql("""
SELECT *
FROM Bonus
""", con)

/tmp/ipykernel_4765/1485923284.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   empId  bonus
0      2    500
1      4   2000

In [156]:
pd.read_sql("""
SELECT e.name, b.bonus 
FROM Employee e
LEFT JOIN Bonus b
    USING (empId)
WHERE b.bonus < 1000 OR b.bonus IS NULL
""", con)

/tmp/ipykernel_4765/1324806185.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   name  bonus
0  Brad    NaN
1  John    NaN
2   Dan  500.0

# Leetcode Question 1965: Employees With Missing Information

In [ ]:
Create table If Not Exists Employees (employee_id int, name varchar(30))
Create table If Not Exists Salaries (employee_id int, salary int)
Truncate table Employees
insert into Employees (employee_id, name) values ('2', 'Crew')
insert into Employees (employee_id, name) values ('4', 'Haven')
insert into Employees (employee_id, name) values ('5', 'Kristian')
Truncate table Salaries
insert into Salaries (employee_id, salary) values ('5', '76071')
insert into Salaries (employee_id, salary) values ('1', '22517')
insert into Salaries (employee_id, salary) values ('4', '63539')

In [164]:
database_creator('Leetcode_Q_1965')

In [165]:
schema = "employee_id int, name varchar(30)"
data = [('2', 'Crew'),
       ('4', 'Haven'),
       ('5', 'Kristian')]

insert_data_to_table("Leetcode_Q_1965", "Employees", schema, data)

In [166]:
schema = "employee_id int, salary int"
data = [('5', '76071'),
       ('1', '22517'),
       ('4', '63539')]

insert_data_to_table("Leetcode_Q_1965", "Salaries", schema, data)

In [167]:
con = connector('Leetcode_Q_1965')

In [168]:
pd.read_sql("""
SELECT *
FROM Employees
""", con)

/tmp/ipykernel_4765/1059816577.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   employee_id      name
0            2      Crew
1            4     Haven
2            5  Kristian

In [169]:
pd.read_sql("""
SELECT *
FROM Salaries
""", con)

/tmp/ipykernel_4765/2259743031.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   employee_id  salary
0            5   76071
1            1   22517
2            4   63539

In [153]:
pd.read_sql("""
SELECT employee_id
FROM Employees e
RIGHT JOIN Salaries s
    USING (employee_id)
WHERE name IS NULL
UNION 
SELECT employee_id
FROM Employees e
LEFT JOIN Salaries s
    USING (employee_id)
WHERE salary IS NULL
ORDER BY employee_id 

""", con)

   employee_id
0            1
1            2

# Leetcode Question 620: Not Boring Movies

In [ ]:
Create table If Not Exists cinema (id int, movie varchar(255), description varchar(255), rating float(2, 1))
Truncate table cinema
insert into cinema (id, movie, description, rating) values ('1', 'War', 'great 3D', '8.9')
insert into cinema (id, movie, description, rating) values ('2', 'Science', 'fiction', '8.5')
insert into cinema (id, movie, description, rating) values ('3', 'irish', 'boring', '6.2')
insert into cinema (id, movie, description, rating) values ('4', 'Ice song', 'Fantacy', '8.6')
insert into cinema (id, movie, description, rating) values ('5', 'House card', 'Interesting', '9.1')

In [170]:
database_creator('Leetcode_Q_620')

In [171]:
schema = "id int, movie varchar(255), description varchar(255), rating float(2, 1)"
data = [('1', 'War', 'great 3D', '8.9'),
       ('2', 'Science', 'fiction', '8.5'),
       ('3', 'irish', 'boring', '6.2'),
       ('4', 'Ice song', 'Fantacy', '8.6'),
       ('5', 'House card', 'Interesting', '9.1')]

insert_data_to_table("Leetcode_Q_620", "cinema", schema, data)

In [172]:
con = connector('Leetcode_Q_620')

In [173]:
pd.read_sql("""
SELECT *
FROM cinema
""", con)

/tmp/ipykernel_4765/2300673331.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   id       movie  description  rating
0   1         War     great 3D     8.9
1   2     Science      fiction     8.5
2   3       irish       boring     6.2
3   4    Ice song      Fantacy     8.6
4   5  House card  Interesting     9.1

In [174]:
pd.read_sql("""
SELECT *
FROM cinema
WHERE id % 2 <> 0 AND description <> 'boring'
ORDER BY rating DESC
""", con)

/tmp/ipykernel_4765/3837550734.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   id       movie  description  rating
0   5  House card  Interesting     9.1
1   1         War     great 3D     8.9

# Leetcode Question 1729: Find Followers Count

In [ ]:
Create table If Not Exists Followers(user_id int, follower_id int)
Truncate table Followers
insert into Followers (user_id, follower_id) values ('0', '1')
insert into Followers (user_id, follower_id) values ('1', '0')
insert into Followers (user_id, follower_id) values ('2', '0')
insert into Followers (user_id, follower_id) values ('2', '1')

In [175]:
database_creator('Leetcode_Q_1729')

In [176]:
schema = "user_id int, follower_id int"
data = [('0', '1'),
       ('1', '0'),
       ('2', '0'),
       ('2', '1')]

insert_data_to_table("Leetcode_Q_1729", "Followers", schema, data)

In [177]:
con = connector('Leetcode_Q_1729')

In [178]:
pd.read_sql("""
SELECT *
FROM Followers
""", con)

/tmp/ipykernel_4765/1608719282.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   user_id  follower_id
0        0            1
1        1            0
2        2            0
3        2            1

In [166]:
pd.read_sql("""
SELECT 
    user_id,
    COUNT(*) AS followers_count
FROM Followers
GROUP BY user_id
ORDER BY user_id
""", con)

   user_id  followers_count
0        0                1
1        1                1
2        2                2

# Leetcode Question 182: Duplicate Emails

In [ ]:
Create table If Not Exists Person (id int, email varchar(255))
Truncate table Person
insert into Person (id, email) values ('1', 'a@b.com')
insert into Person (id, email) values ('2', 'c@d.com')
insert into Person (id, email) values ('3', 'a@b.com')

In [179]:
database_creator('Leetcode_Q_182')

In [180]:
schema = "id int, email varchar(255)"
data = [('1', 'a@b.com'),
       ('2', 'c@d.com'),
       ('3', 'a@b.com')]

insert_data_to_table("Leetcode_Q_182", "Person", schema, data)

In [181]:
con = connector('Leetcode_Q_182')

In [182]:
pd.read_sql("""
SELECT *
FROM Person
""", con)

/tmp/ipykernel_4765/2244786807.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [171]:
pd.read_sql("""
SELECT DISTINCT email
FROM Person
WHERE email IN(
                SELECT email
                FROM Person
                GROUP BY email
                HAVING COUNT(*) > 1  
            )
""", con)

     email
0  a@b.com

# Leetcode Question 610: Triangle Judgement

In [ ]:
Create table If Not Exists Triangle (x int, y int, z int)
Truncate table Triangle
insert into Triangle (x, y, z) values ('13', '15', '30')
insert into Triangle (x, y, z) values ('10', '20', '15')

In [183]:
database_creator('Leetcode_Q_610')

In [184]:
schema = "x int, y int, z int"
data = [('13', '15', '30'),
       ('10', '20', '15')]

insert_data_to_table("Leetcode_Q_610", "Triangle", schema, data)

In [185]:
con = connector('Leetcode_Q_610')

In [173]:
pd.read_sql("""
SELECT *
FROM Triangle
""", con)

    x   y   z
0  13  15  30
1  10  20  15

In [186]:
pd.read_sql("""
SELECT 
    *,
    CASE
       WHEN x + y > z AND x + z > y AND y + z > x THEN 'Yes' 
       ELSE 'No'
    END AS triangle
FROM Triangle
""", con)

/tmp/ipykernel_4765/1250539922.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

    x   y   z triangle
0  13  15  30       No
1  10  20  15      Yes

# Leetcode Question 1211: Queries Quality and Percentage

In [ ]:
Create table If Not Exists Queries (query_name varchar(30), result varchar(50), position int, rating int)
Truncate table Queries
insert into Queries (query_name, result, position, rating) values ('Dog', 'Golden Retriever', '1', '5')
insert into Queries (query_name, result, position, rating) values ('Dog', 'German Shepherd', '2', '5')
insert into Queries (query_name, result, position, rating) values ('Dog', 'Mule', '200', '1')
insert into Queries (query_name, result, position, rating) values ('Cat', 'Shirazi', '5', '2')
insert into Queries (query_name, result, position, rating) values ('Cat', 'Siamese', '3', '3')
insert into Queries (query_name, result, position, rating) values ('Cat', 'Sphynx', '7', '4')

In [187]:
database_creator('Leetcode_Q_1211')

In [188]:
schema = "query_name varchar(30), result varchar(50), position int, rating int"
data = [('Dog', 'Golden Retriever', '1', '5'),
       ('Dog', 'German Shepherd', '2', '5'),
       ('Dog', 'Mule', '200', '1'),
       ('Cat', 'Shirazi', '5', '2'),
       ('Cat', 'Siamese', '3', '3'),
       ('Cat', 'Sphynx', '7', '4')]

insert_data_to_table("Leetcode_Q_1211", "Queries", schema, data)

In [189]:
con = connector('Leetcode_Q_1211')

In [186]:
pd.read_sql("""
SELECT *
FROM Queries
""", con)

  query_name            result  position  rating
0        Dog  Golden Retriever         1       5
1        Dog   German Shepherd         2       5
2        Dog              Mule       200       1
3        Cat           Shirazi         5       2
4        Cat           Siamese         3       3
5        Cat            Sphynx         7       4

In [248]:
pd.read_sql("""
SELECT 
    query_name,
    ROUND(AVG(rating/position), 2) AS quality, 
    ROUND(SUM(CASE 
                    WHEN rating < 3 THEN 1 
                    ELSE 0 
                END
                ) / COUNT(*) *100, 2)
        AS poor_query_percentage 
FROM Queries
GROUP BY query_name

""", con)

  query_name  quality  poor_query_percentage
0        Dog     2.50                  33.33
1        Cat     0.66                  33.33

# Leetcode Question 1050: Actors and Directors Who Cooperated At Least Three Times

In [ ]:
Create table If Not Exists ActorDirector (actor_id int, director_id int, timestamp int)
Truncate table ActorDirector
insert into ActorDirector (actor_id, director_id, timestamp) values ('1', '1', '0')
insert into ActorDirector (actor_id, director_id, timestamp) values ('1', '1', '1')
insert into ActorDirector (actor_id, director_id, timestamp) values ('1', '1', '2')
insert into ActorDirector (actor_id, director_id, timestamp) values ('1', '2', '3')
insert into ActorDirector (actor_id, director_id, timestamp) values ('1', '2', '4')
insert into ActorDirector (actor_id, director_id, timestamp) values ('2', '1', '5')
insert into ActorDirector (actor_id, director_id, timestamp) values ('2', '1', '6')

In [191]:
database_creator('Leetcode_Q_1050')

In [192]:
schema = "actor_id int, director_id int, timestamp int"
data = [('1', '1', '0'),
       ('1', '1', '1'),
       ('1', '1', '2'),
       ('1', '2', '3'),
       ('1', '2', '4'),
       ('2', '1', '5'),
       ('2', '1', '6')]

insert_data_to_table("Leetcode_Q_1050", "ActorDirector", schema, data)

In [193]:
con = connector('Leetcode_Q_1050')

In [260]:
pd.read_sql("""
SELECT *
FROM ActorDirector
""", con)

   actor_id  director_id  timestamp
0         1            1          0
1         1            1          1
2         1            1          2
3         1            2          3
4         1            2          4
5         2            1          5
6         2            1          6

In [268]:
pd.read_sql("""
SELECT 
    actor_id,
    director_id
FROM ActorDirector
GROUP BY actor_id, director_id
HAVING COUNT(*) >=3
""", con)

   actor_id  director_id
0         1            1

# Leetcode Question 1280: Students and Examinations

In [ ]:
Create table If Not Exists Students (student_id int, student_name varchar(20))
Create table If Not Exists Subjects (subject_name varchar(20))
Create table If Not Exists Examinations (student_id int, subject_name varchar(20))
Truncate table Students
insert into Students (student_id, student_name) values ('1', 'Alice')
insert into Students (student_id, student_name) values ('2', 'Bob')
insert into Students (student_id, student_name) values ('13', 'John')
insert into Students (student_id, student_name) values ('6', 'Alex')
Truncate table Subjects
insert into Subjects (subject_name) values ('Math')
insert into Subjects (subject_name) values ('Physics')
insert into Subjects (subject_name) values ('Programming')
Truncate table Examinations
insert into Examinations (student_id, subject_name) values ('1', 'Math')
insert into Examinations (student_id, subject_name) values ('1', 'Physics')
insert into Examinations (student_id, subject_name) values ('1', 'Programming')
insert into Examinations (student_id, subject_name) values ('2', 'Programming')
insert into Examinations (student_id, subject_name) values ('1', 'Physics')
insert into Examinations (student_id, subject_name) values ('1', 'Math')
insert into Examinations (student_id, subject_name) values ('13', 'Math')
insert into Examinations (student_id, subject_name) values ('13', 'Programming')
insert into Examinations (student_id, subject_name) values ('13', 'Physics')
insert into Examinations (student_id, subject_name) values ('2', 'Math')
insert into Examinations (student_id, subject_name) values ('1', 'Math')

In [194]:
database_creator('Leetcode_Q_1280')

In [195]:
schema = "student_id int, student_name varchar(20)"
data = [('1', 'Alice'),
       ('2', 'Bob'),
       ('13', 'John'),
       ('6', 'Alex')]

insert_data_to_table("Leetcode_Q_1280", "Students", schema, data)

In [196]:
schema = "subject_name varchar(20)"
data = [('Math'), ('Physics'), ('Programming')]

insert_data_to_table_modified("Leetcode_Q_1280", "Subjects", schema, data)

In [197]:
schema = "student_id int, subject_name varchar(20)"
data = [('1', 'Math'),
       ('1', 'Physics'),
       ('1', 'Programming'),
       ('2', 'Programming'),
       ('1', 'Physics'),
       ('1', 'Math'),
       ('13', 'Math'),
       ('13', 'Programming'),
       ('13', 'Physics'),
       ('2', 'Math'),
       ('1', 'Math')]

insert_data_to_table("Leetcode_Q_1280", "Examinations", schema, data)

In [198]:
con = connector('Leetcode_Q_1280')

In [270]:
pd.read_sql("""
SELECT *
FROM Students
""", con)

   student_id student_name
0           1        Alice
1           2          Bob
2          13         John
3           6         Alex

In [271]:
pd.read_sql("""
SELECT *
FROM Subjects
""", con)

  subject_name
0         Math
1      Physics
2  Programming

In [272]:
pd.read_sql("""
SELECT *
FROM Examinations
""", con)

    student_id subject_name
0            1         Math
1            1      Physics
2            1  Programming
3            2  Programming
4            1      Physics
5            1         Math
6           13         Math
7           13  Programming
8           13      Physics
9            2         Math
10           1         Math

In [330]:
pd.read_sql("""
SELECT 
    st.student_id,
    st.student_name,
    su.subject_name, 
    COUNT(e.subject_name) AS attended_exams
FROM Students st
JOIN Subjects su
LEFT JOIN Examinations e
    ON st.student_id = e.student_id AND
       su.subject_name = e.subject_name
GROUP BY st.student_id, st.student_name, su.subject_name
ORDER BY student_id, student_name
""", con)

    student_id student_name subject_name  attended_exams
0            1        Alice         Math               3
1            1        Alice      Physics               2
2            1        Alice  Programming               1
3            2          Bob         Math               1
4            2          Bob      Physics               0
5            2          Bob  Programming               1
6            6         Alex         Math               0
7            6         Alex      Physics               0
8            6         Alex  Programming               0
9           13         John         Math               1
10          13         John      Physics               1
11          13         John  Programming               1

# Leetcode Question 595: Big Countries

In [ ]:
Create table If Not Exists World (name varchar(255), continent varchar(255), area int, population int, gdp bigint)
Truncate table World
insert into World (name, continent, area, population, gdp) values ('Afghanistan', 'Asia', '652230', '25500100', '20343000000')
insert into World (name, continent, area, population, gdp) values ('Albania', 'Europe', '28748', '2831741', '12960000000')
insert into World (name, continent, area, population, gdp) values ('Algeria', 'Africa', '2381741', '37100000', '188681000000')
insert into World (name, continent, area, population, gdp) values ('Andorra', 'Europe', '468', '78115', '3712000000')
insert into World (name, continent, area, population, gdp) values ('Angola', 'Africa', '1246700', '20609294', '100990000000')

In [199]:
database_creator('Leetcode_Q_595')

In [200]:
schema = "name varchar(255), continent varchar(255), area int, population int, gdp bigint"
data = [('Afghanistan', 'Asia', '652230', '25500100', '20343000000'),
       ('Albania', 'Europe', '28748', '2831741', '12960000000'),
       ('Algeria', 'Africa', '2381741', '37100000', '188681000000'),
       ('Andorra', 'Europe', '468', '78115', '3712000000'),
        ('Angola', 'Africa', '1246700', '20609294', '100990000000')]

insert_data_to_table("Leetcode_Q_595", "World", schema, data)

In [201]:
con = connector('Leetcode_Q_595')

In [5]:
pd.read_sql("""
SELECT *
FROM World
""", con)

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [13]:
pd.read_sql("""
SELECT 
    name,
    population,
    area
FROM World
WHERE area >= 3000000 OR population >= 25000000
""", con)

          name  population     area
0  Afghanistan    25500100   652230
1      Algeria    37100000  2381741

# Leetcode Question 584: Find Customer Referee

In [ ]:
Create table If Not Exists Customer (id int, name varchar(25), referee_id int)
Truncate table Customer
insert into Customer (id, name, referee_id) values ('1', 'Will', 'None')
insert into Customer (id, name, referee_id) values ('2', 'Jane', 'None')
insert into Customer (id, name, referee_id) values ('3', 'Alex', '2')
insert into Customer (id, name, referee_id) values ('4', 'Bill', 'None')
insert into Customer (id, name, referee_id) values ('5', 'Zack', '1')
insert into Customer (id, name, referee_id) values ('6', 'Mark', '2')

In [203]:
database_creator('Leetcode_Q_584')

In [204]:
schema = "id int, name varchar(25), referee_id int"
data = [('1', 'Will', None),
       ('2', 'Jane', None),
       ('3', 'Alex', '2'),
       ('4', 'Bill', None),
       ('5', 'Zack', '1'),
       ('6', 'Mark', '2')]

insert_data_to_table("Leetcode_Q_584", "Customer", schema, data)

In [205]:
con = connector('Leetcode_Q_584')

In [5]:
pd.read_sql("""
SELECT *
FROM Customer
""", con)

   id  name  referee_id
0   1  Will         NaN
1   2  Jane         NaN
2   3  Alex         2.0
3   4  Bill         NaN
4   5  Zack         1.0
5   6  Mark         2.0

In [8]:
pd.read_sql("""
SELECT name
FROM Customer
WHERE referee_id != 2 or referee_id IS NULL
""", con)

   name
0  Will
1  Jane
2  Bill
3  Zack

# Leetcode Question 181: Employees Earning More Than Their Managers

In [ ]:
Create table If Not Exists Employee (id int, name varchar(255), salary int, managerId int)
Truncate table Employee
insert into Employee (id, name, salary, managerId) values ('1', 'Joe', '70000', '3')
insert into Employee (id, name, salary, managerId) values ('2', 'Henry', '80000', '4')
insert into Employee (id, name, salary, managerId) values ('3', 'Sam', '60000', 'None')
insert into Employee (id, name, salary, managerId) values ('4', 'Max', '90000', 'None')

In [206]:
database_creator('Leetcode_Q_181')

In [207]:
schema = "id int, name varchar(255), salary int, managerId int"
data = [('1', 'Joe', '70000', '3'),
       ('2', 'Henry', '80000', '4'),
       ('3', 'Sam', '60000', None),
       ('4', 'Max', '90000', None)]

insert_data_to_table("Leetcode_Q_181", "Employee", schema, data)

In [208]:
con = connector('Leetcode_Q_181')

In [10]:
pd.read_sql("""
SELECT *
FROM Employee
""", con)

   id   name  salary  managerId
0   1    Joe   70000        3.0
1   2  Henry   80000        4.0
2   3    Sam   60000        NaN
3   4    Max   90000        NaN

In [209]:
pd.read_sql("""
SELECT e.name AS Employee
FROM Employee e
JOIN Employee em
    ON e.managerId = em.id
WHERE e.salary > em.salary
""", con)

/tmp/ipykernel_4765/937966064.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

  Employee
0      Joe

# Leetcode Question 607: Sales Person

In [ ]:
Create table If Not Exists SalesPerson (sales_id int, name varchar(255), salary int, commission_rate int, hire_date date)
Create table If Not Exists Company (com_id int, name varchar(255), city varchar(255))
Create table If Not Exists Orders (order_id int, order_date date, com_id int, sales_id int, amount int)
Truncate table SalesPerson
insert into SalesPerson (sales_id, name, salary, commission_rate, hire_date) values ('1', 'John', '100000', '6', '4/1/2006')
insert into SalesPerson (sales_id, name, salary, commission_rate, hire_date) values ('2', 'Amy', '12000', '5', '5/1/2010')
insert into SalesPerson (sales_id, name, salary, commission_rate, hire_date) values ('3', 'Mark', '65000', '12', '12/25/2008')
insert into SalesPerson (sales_id, name, salary, commission_rate, hire_date) values ('4', 'Pam', '25000', '25', '1/1/2005')
insert into SalesPerson (sales_id, name, salary, commission_rate, hire_date) values ('5', 'Alex', '5000', '10', '2/3/2007')
Truncate table Company
insert into Company (com_id, name, city) values ('1', 'RED', 'Boston')
insert into Company (com_id, name, city) values ('2', 'ORANGE', 'New York')
insert into Company (com_id, name, city) values ('3', 'YELLOW', 'Boston')
insert into Company (com_id, name, city) values ('4', 'GREEN', 'Austin')
Truncate table Orders
insert into Orders (order_id, order_date, com_id, sales_id, amount) values ('1', '1/1/2014', '3', '4', '10000')
insert into Orders (order_id, order_date, com_id, sales_id, amount) values ('2', '2/1/2014', '4', '5', '5000')
insert into Orders (order_id, order_date, com_id, sales_id, amount) values ('3', '3/1/2014', '1', '1', '50000')
insert into Orders (order_id, order_date, com_id, sales_id, amount) values ('4', '4/1/2014', '1', '4', '25000')

In [6]:
database_creator('Leetcode_Q_607')

In [7]:
schema = "sales_id int, name varchar(255), salary int, commission_rate int, hire_date date"
data = [('1', 'John', '100000', '6', '2006-04-01'),
       ('2', 'Amy', '12000', '5', '2010-05-01'),
       ('3', 'Mark', '65000', '12', '2008-12-25'),
       ('4', 'Pam', '25000', '25', '2005-01-01'),
       ('5', 'Alex', '5000', '10', '2007-02-03')]

insert_data_to_table("Leetcode_Q_607", "SalesPerson", schema, data)

In [8]:
schema = "com_id int, name varchar(255), city varchar(255)"
data = [('1', 'RED', 'Boston'),
       ('2', 'ORANGE', 'New York'),
       ('3', 'YELLOW', 'Boston'),
       ('4', 'GREEN', 'Austin')]

insert_data_to_table("Leetcode_Q_607", "Company", schema, data)

In [9]:
schema = "order_id int, order_date date, com_id int, sales_id int, amount int"
data = [('1', '2014-01-01', '3', '4', '10000'),
       ('2', '2014-02-01', '4', '5', '5000'),
       ('3', '2014-03-01', '1', '1', '50000'),
       ('4', '2014-04-01', '1', '4', '25000')]

insert_data_to_table("Leetcode_Q_607", "Orders", schema, data)

In [10]:
con = connector('Leetcode_Q_607')

In [23]:
pd.read_sql("""
SELECT *
FROM SalesPerson
""", con)

   sales_id  name  salary  commission_rate   hire_date
0         1  John  100000                6  2006-04-01
1         2   Amy   12000                5  2010-05-01
2         3  Mark   65000               12  2008-12-25
3         4   Pam   25000               25  2005-01-01
4         5  Alex    5000               10  2007-02-03

In [24]:
pd.read_sql("""
SELECT *
FROM Company
""", con)

   com_id    name      city
0       1     RED    Boston
1       2  ORANGE  New York
2       3  YELLOW    Boston
3       4   GREEN    Austin

In [25]:
pd.read_sql("""
SELECT *
FROM Orders
""", con)

   order_id  order_date  com_id  sales_id  amount
0         1  2014-01-01       3         4   10000
1         2  2014-02-01       4         5    5000
2         3  2014-03-01       1         1   50000
3         4  2014-04-01       1         4   25000

In [67]:
pd.read_sql("""
SELECT 
    name 
FROM SalesPerson 
WHERE sales_id NOT IN(
            SELECT sales_id 
            FROM Orders 
            WHERE com_id IN
                    (SELECT com_id 
                    FROM Company 
                    WHERE name='Red')
                )
""", con)

   name
0   Amy
1  Mark
2  Alex

# Leetcode Question 183: Customers Who Never Order

In [ ]:
Create table If Not Exists Customers (id int, name varchar(255))
Create table If Not Exists Orders (id int, customerId int)
Truncate table Customers
insert into Customers (id, name) values ('1', 'Joe')
insert into Customers (id, name) values ('2', 'Henry')
insert into Customers (id, name) values ('3', 'Sam')
insert into Customers (id, name) values ('4', 'Max')
Truncate table Orders
insert into Orders (id, customerId) values ('1', '3')
insert into Orders (id, customerId) values ('2', '1')

In [11]:
database_creator('Leetcode_Q_183')

In [12]:
schema = "id int, name varchar(255)"
data = [('1', 'Joe'),
        ('2', 'Henry'),
        ('3', 'Sam'),
        ('4', 'Max')]

insert_data_to_table("Leetcode_Q_183", "Customers", schema, data)

In [13]:
schema = "id int, customerId int"
data = [('1', '3'),
       ('2', '1')]

insert_data_to_table("Leetcode_Q_183", "Orders", schema, data)

In [14]:
con = connector('Leetcode_Q_183')

In [69]:
pd.read_sql("""
SELECT *
FROM Customers
""", con)

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [70]:
pd.read_sql("""
SELECT *
FROM Orders
""", con)

   id  customerId
0   1           3
1   2           1

In [76]:
pd.read_sql("""
SELECT 
    c.name AS Customers
FROM Customers c
LEFT JOIN Orders o
    ON c.id = o.customerId
WHERE o.id IS NULL
""", con)

  Customers
0     Henry
1       Max

# Leetcode Question 586: Customer Placing the Largest Number of Orders

In [ ]:
Create table If Not Exists orders (order_number int, customer_number int)
Truncate table orders
insert into orders (order_number, customer_number) values ('1', '1')
insert into orders (order_number, customer_number) values ('2', '2')
insert into orders (order_number, customer_number) values ('3', '3')
insert into orders (order_number, customer_number) values ('4', '3')

In [15]:
database_creator('Leetcode_Q_586')

In [16]:
schema = "order_number int, customer_number int"
data = [('1', '1'),
       ('2', '2'),
       ('3', '3'),
       ('4', '3')]

insert_data_to_table("Leetcode_Q_586", "orders", schema, data)

In [17]:
con = connector('Leetcode_Q_586')

In [78]:
pd.read_sql("""
SELECT *
FROM orders
""", con)

   order_number  customer_number
0             1                1
1             2                2
2             3                3
3             4                3

In [112]:
pd.read_sql("""
SELECT 
    customer_number 
FROM orders
GROUP BY customer_number
ORDER BY COUNT(order_number) DESC 
LIMIT 1
""", con)

   customer_number
0                3

In [ ]:
# another solution using a subquery

In [18]:
pd.read_sql("""

SELECT customer_number
FROM orders
GROUP BY customer_number
HAVING COUNT(order_number) = (
                    SELECT MAX(order_count) 
                    FROM (
                        SELECT customer_number, COUNT(order_number) AS order_count
                        FROM orders
                        GROUP BY customer_number
                    ) AS subquery
)

""", con)

/tmp/ipykernel_4953/2426670018.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   customer_number
0                3

# Leetcode Question 1075: Project Employees I

In [ ]:
Create table If Not Exists Project (project_id int, employee_id int)
Create table If Not Exists Employee (employee_id int, name varchar(10), experience_years int)
Truncate table Project
insert into Project (project_id, employee_id) values ('1', '1')
insert into Project (project_id, employee_id) values ('1', '2')
insert into Project (project_id, employee_id) values ('1', '3')
insert into Project (project_id, employee_id) values ('2', '1')
insert into Project (project_id, employee_id) values ('2', '4')
Truncate table Employee
insert into Employee (employee_id, name, experience_years) values ('1', 'Khaled', '3')
insert into Employee (employee_id, name, experience_years) values ('2', 'Ali', '2')
insert into Employee (employee_id, name, experience_years) values ('3', 'John', '1')
insert into Employee (employee_id, name, experience_years) values ('4', 'Doe', '2')

In [19]:
database_creator('Leetcode_Q_1075')

In [20]:
schema = "project_id int, employee_id int"
data = [('1', '1'),
       ('1', '2'),
       ('1', '3'),
       ('2', '1'),
       ('2', '4')]

insert_data_to_table("Leetcode_Q_1075", "Project", schema, data)

In [21]:
schema = "employee_id int, name varchar(10), experience_years int"
data = [('1', 'Khaled', '3'),
       ('2', 'Ali', '2'),
       ('3', 'John', '1'),
       ('4', 'Doe', '2')]

insert_data_to_table("Leetcode_Q_1075", "Employee", schema, data)

In [22]:
con = connector('Leetcode_Q_1075')

In [114]:
pd.read_sql("""
SELECT *
FROM Project
""", con)

   project_id  employee_id
0           1            1
1           1            2
2           1            3
3           2            1
4           2            4

In [115]:
pd.read_sql("""
SELECT *
FROM Employee
""", con)

   employee_id    name  experience_years
0            1  Khaled                 3
1            2     Ali                 2
2            3    John                 1
3            4     Doe                 2

In [123]:
pd.read_sql("""
SELECT 
    project_id,
    ROUND(AVG(CAST(experience_years AS DECIMAL(10, 2))), 2) AS average_years
    
FROM Project
JOIN Employee
    USING (employee_id)
GROUP BY project_id
""", con)

   project_id  average_years
0           1            2.0
1           2            2.5

# Leetcode Question 1633: Percentage of Users Attended a Contest

In [ ]:
Create table If Not Exists Users (user_id int, user_name varchar(20))
Create table If Not Exists Register (contest_id int, user_id int)
Truncate table Users
insert into Users (user_id, user_name) values ('6', 'Alice')
insert into Users (user_id, user_name) values ('2', 'Bob')
insert into Users (user_id, user_name) values ('7', 'Alex')
Truncate table Register
insert into Register (contest_id, user_id) values ('215', '6')
insert into Register (contest_id, user_id) values ('209', '2')
insert into Register (contest_id, user_id) values ('208', '2')
insert into Register (contest_id, user_id) values ('210', '6')
insert into Register (contest_id, user_id) values ('208', '6')
insert into Register (contest_id, user_id) values ('209', '7')
insert into Register (contest_id, user_id) values ('209', '6')
insert into Register (contest_id, user_id) values ('215', '7')
insert into Register (contest_id, user_id) values ('208', '7')
insert into Register (contest_id, user_id) values ('210', '2')
insert into Register (contest_id, user_id) values ('207', '2')
insert into Register (contest_id, user_id) values ('210', '7')

In [23]:
database_creator('Leetcode_Q_1633')

In [24]:
schema = "user_id int, user_name varchar(20)"
data = [('6', 'Alice'),
       ('2', 'Bob'),
       ('7', 'Alex')]

insert_data_to_table("Leetcode_Q_1633", "Users", schema, data)

In [25]:
schema = "contest_id int, user_id int"
data = [('215', '6'),
       ('209', '2'),
       ('208', '2'),
       ('210', '6'),
       ('208', '6'),
       ('209', '7'),
       ('209', '6'),
       ('215', '7'),
       ('208', '7'),
       ('210', '2'),
       ('207', '2'),
       ('210', '7')]

insert_data_to_table("Leetcode_Q_1633", "Register", schema, data)

In [26]:
con = connector('Leetcode_Q_1633')

In [7]:
pd.read_sql("""
SELECT *
FROM Users
""", con)

   user_id user_name
0        6     Alice
1        2       Bob
2        7      Alex

In [8]:
pd.read_sql("""
SELECT *
FROM Register
""", con)

    contest_id  user_id
0          215        6
1          209        2
2          208        2
3          210        6
4          208        6
5          209        7
6          209        6
7          215        7
8          208        7
9          210        2
10         207        2
11         210        7

In [37]:
pd.read_sql("""
SELECT 
    contest_id, 
    ROUND(COUNT(user_id) / (
                        SELECT COUNT(*) FROM Users
                        ) * 100, 2) AS percentage
FROM Register 
GROUP BY contest_id
ORDER BY percentage DESC, contest_id
""", con)

   contest_id  percentage
0         208      100.00
1         209      100.00
2         210      100.00
3         215       66.67
4         207       33.33

# Leetcode Question 1667: Fix Names in a Table

In [ ]:
Create table If Not Exists Users (user_id int, name varchar(40))
Truncate table Users
insert into Users (user_id, name) values ('1', 'aLice')
insert into Users (user_id, name) values ('2', 'bOB')

In [27]:
database_creator('Leetcode_Q_1667')

In [28]:
schema = "user_id int, name varchar(40)"
data = [('1', 'aLice'),
       ('2', 'bOB')]

insert_data_to_table("Leetcode_Q_1667", "Users", schema, data)

In [29]:
con = connector('Leetcode_Q_1667')

In [39]:
pd.read_sql("""
SELECT *
FROM Users
""", con)

   user_id   name
0        1  aLice
1        2    bOB

In [54]:
pd.read_sql("""
SELECT 
    user_id,
    CONCAT(UPPER(LEFT(name, 1)), LOWER(RIGHT(name, LENGTH(name)-1))) AS name
FROM Users
ORDER BY user_id
""", con)

   user_id   name
0        1  Alice
1        2    Bob

# Leetcode Question 1407: Top Travellers

In [ ]:
Create Table If Not Exists Users (id int, name varchar(30))
Create Table If Not Exists Rides (id int, user_id int, distance int)
Truncate table Users
insert into Users (id, name) values ('1', 'Alice')
insert into Users (id, name) values ('2', 'Bob')
insert into Users (id, name) values ('3', 'Alex')
insert into Users (id, name) values ('4', 'Donald')
insert into Users (id, name) values ('7', 'Lee')
insert into Users (id, name) values ('13', 'Jonathan')
insert into Users (id, name) values ('19', 'Elvis')
Truncate table Rides
insert into Rides (id, user_id, distance) values ('1', '1', '120')
insert into Rides (id, user_id, distance) values ('2', '2', '317')
insert into Rides (id, user_id, distance) values ('3', '3', '222')
insert into Rides (id, user_id, distance) values ('4', '7', '100')
insert into Rides (id, user_id, distance) values ('5', '13', '312')
insert into Rides (id, user_id, distance) values ('6', '19', '50')
insert into Rides (id, user_id, distance) values ('7', '7', '120')
insert into Rides (id, user_id, distance) values ('8', '19', '400')
insert into Rides (id, user_id, distance) values ('9', '7', '230')

In [31]:
database_creator('Leetcode_Q_1407')

In [32]:
schema = "id int, name varchar(30)"
data = [ ('1', 'Alice'),
       ('2', 'Bob'),
       ('3', 'Alex'),
       ('4', 'Donald'),
       ('7', 'Lee'),
       ('13', 'Jonathan'),
       ('19', 'Elvis')]

insert_data_to_table("Leetcode_Q_1407", "Users", schema, data)

In [33]:
schema = "id int, user_id int, distance int"
data = [('1', '1', '120'),
       ('2', '2', '317'),
       ('3', '3', '222'),
       ('4', '7', '100'),
       ('5', '13', '312'),
       ('6', '19', '50'),
       ('7', '7', '120'),
       ('8', '19', '400'),
       ('9', '7', '230')]

insert_data_to_table("Leetcode_Q_1407", "Rides", schema, data)

In [34]:
con = connector('Leetcode_Q_1407')

In [56]:
pd.read_sql("""
SELECT *
FROM Users
""", con)

   id      name
0   1     Alice
1   2       Bob
2   3      Alex
3   4    Donald
4   7       Lee
5  13  Jonathan
6  19     Elvis

In [57]:
pd.read_sql("""
SELECT *
FROM Rides
""", con)

   id  user_id  distance
0   1        1       120
1   2        2       317
2   3        3       222
3   4        7       100
4   5       13       312
5   6       19        50
6   7        7       120
7   8       19       400
8   9        7       230

In [93]:
pd.read_sql("""
SELECT
    u.name, 
    IFNULL(SUM(distance), 0) AS travelled_distance
FROM Users u
LEFT JOIN Rides r
    ON u.id = r.user_id
GROUP BY u.name, u.id
ORDER BY travelled_distance DESC, name

""", con)

       name  travelled_distance
0     Elvis               450.0
1       Lee               450.0
2       Bob               317.0
3  Jonathan               312.0
4      Alex               222.0
5     Alice               120.0
6    Donald                 0.0

# Leetcode Question 196: Delete Duplicate Emails

In [ ]:
Create table If Not Exists Person (Id int, Email varchar(255))
Truncate table Person
insert into Person (id, email) values ('1', 'john@example.com')
insert into Person (id, email) values ('2', 'bob@example.com')
insert into Person (id, email) values ('3', 'john@example.com')

In [4]:
database_creator('Leetcode_Q_196')

In [5]:
schema = "Id int, Email varchar(255)"
data = [('1', 'john@example.com'), 
       ('2', 'bob@example.com'),
       ('3', 'john@example.com')]

insert_data_to_table("Leetcode_Q_196", "Person", schema, data)

In [6]:
con = connector('Leetcode_Q_196')

In [7]:
pd.read_sql("""
SELECT *
FROM Person
""", con)

/tmp/ipykernel_6016/2244786807.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   Id             Email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [38]:
cursor = con.cursor()

cursor.execute("""

DELETE FROM Person
WHERE id NOT IN (
  SELECT id_to_keep
  FROM (
    SELECT MIN(id) as id_to_keep
    FROM Person
    GROUP BY email
  ) AS t

)
""")

con.commit()
cursor.close()

In [39]:
pd.read_sql("""
SELECT *
FROM Person
""", con)

/tmp/ipykernel_4953/2244786807.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   Id             Email
0   1  john@example.com
1   2   bob@example.com

# Leetcode Question 1873: Calculate Special Bonus

In [ ]:
Create table If Not Exists Employees (employee_id int, name varchar(30), salary int)
Truncate table Employees
insert into Employees (employee_id, name, salary) values ('2', 'Meir', '3000')
insert into Employees (employee_id, name, salary) values ('3', 'Michael', '3800')
insert into Employees (employee_id, name, salary) values ('7', 'Addilyn', '7400')
insert into Employees (employee_id, name, salary) values ('8', 'Juan', '6100')
insert into Employees (employee_id, name, salary) values ('9', 'Kannon', '7700')

In [8]:
database_creator('Leetcode_Q_1873')

In [9]:
schema = "employee_id int, name varchar(30), salary int"
data = [('2', 'Meir', '3000'),
       ('3', 'Michael', '3800'),
       ('7', 'Addilyn', '7400'),
       ('8', 'Juan', '6100'),
       ('9', 'Kannon', '7700')]

insert_data_to_table("Leetcode_Q_1873", "Employees", schema, data)

In [17]:
con = connector('Leetcode_Q_1873')

In [18]:
pd.read_sql("""
SELECT *
FROM Employees
""", con)

/tmp/ipykernel_6016/1059816577.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [111]:
pd.read_sql("""
SELECT 
    employee_id,
    salary AS bonus
FROM Employees
WHERE employee_id %2 =1 AND NOT name REGEXP '^M'

UNION
SELECT 
    employee_id,
    0 AS bonus
FROM Employees
WHERE NOT(employee_id %2 =1 AND NOT name REGEXP '^M')
ORDER BY employee_id
""", con)

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

In [22]:
# better solution

pd.read_sql("""

SELECT 
    employee_id,
    CASE
        WHEN employee_id % 2 <> 0 AND NOT name REGEXP '^M' THEN salary
        ELSE 0
    END AS bonus
FROM Employees
ORDER BY employee_id



""", con)

/tmp/ipykernel_6016/193028933.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

# Leetcode Question 1517: Find Users With Valid E-Mails

In [ ]:
Create table If Not Exists Users (user_id int, name varchar(30), mail varchar(50))
Truncate table Users
insert into Users (user_id, name, mail) values ('1', 'Winston', 'winston@leetcode.com')
insert into Users (user_id, name, mail) values ('2', 'Jonathan', 'jonathanisgreat')
insert into Users (user_id, name, mail) values ('3', 'Annabelle', 'bella-@leetcode.com')
insert into Users (user_id, name, mail) values ('4', 'Sally', 'sally.come@leetcode.com')
insert into Users (user_id, name, mail) values ('5', 'Marwan', 'quarz#2020@leetcode.com')
insert into Users (user_id, name, mail) values ('6', 'David', 'david69@gmail.com')
insert into Users (user_id, name, mail) values ('7', 'Shapiro', '.shapo@leetcode.com')

In [23]:
database_creator('Leetcode_Q_1517')

In [24]:
schema = "user_id int, name varchar(30), mail varchar(50)"
data = [ ('1', 'Winston', 'winston@leetcode.com'),
       ('2', 'Jonathan', 'jonathanisgreat'),
       ('3', 'Annabelle', 'bella-@leetcode.com'),
       ('4', 'Sally', 'sally.come@leetcode.com'),
       ('5', 'Marwan', 'quarz#2020@leetcode.com'),
       ('6', 'David', 'david69@gmail.com'),
       ('7', 'Shapiro', '.shapo@leetcode.com')]

insert_data_to_table("Leetcode_Q_1517", "Users", schema, data)

In [25]:
con = connector('Leetcode_Q_1517')

In [5]:
pd.read_sql("""
SELECT *
FROM Users
""", con)

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
1        2   Jonathan          jonathanisgreat
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com
4        5     Marwan  quarz#2020@leetcode.com
5        6      David        david69@gmail.com
6        7    Shapiro      .shapo@leetcode.com

In [36]:
pd.read_sql("""
SELECT  *
FROM Users
WHERE mail REGEXP '^[a-zA-Z][a-zA-Z0-9._-]*@leetcode\\.com'
""", con)

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
1        3  Annabelle      bella-@leetcode.com
2        4      Sally  sally.come@leetcode.com

# Leetcode Question 619: Biggest Single Number

In [ ]:
Create table If Not Exists MyNumbers (num int)
Truncate table MyNumbers
insert into MyNumbers (num) values ('8')
insert into MyNumbers (num) values ('8')
insert into MyNumbers (num) values ('3')
insert into MyNumbers (num) values ('3')
insert into MyNumbers (num) values ('1')
insert into MyNumbers (num) values ('4')
insert into MyNumbers (num) values ('5')
insert into MyNumbers (num) values ('6')

In [26]:
database_creator('Leetcode_Q_619')

In [27]:
schema = "num int"
data = [('8'),
       ('8'),
       ('3'),
       ('3'),
       ('1'),
       ('4'),
       ('5'),
       ('6')]

insert_data_to_table_modified("Leetcode_Q_619", "MyNumbers", schema, data)

In [28]:
con = connector('Leetcode_Q_619')

In [38]:
pd.read_sql("""
SELECT *
FROM MyNumbers
""", con)

   num
0    8
1    8
2    3
3    3
4    1
5    4
6    5
7    6

In [63]:
pd.read_sql("""
SELECT IFNULL (
    (SELECT MAX(num) 
    FROM (
        SELECT num
        FROM MyNumbers
        GROUP BY num
        HAVING COUNT(*) = 1
    ) AS unique_nums), NULL) AS num
""", con)

   num
0    6

In [29]:
# OR

pd.read_sql("""

SELECT IFNULL(MAX(num), NULL) AS num
FROM MyNumbers
WHERE num IN(
            SELECT num
            FROM MyNumbers
            GROUP BY num
            HAVING COUNT(num) = 1

)

""", con)

/tmp/ipykernel_6016/3749329868.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   num
0    6

# Leetcode Question 1978: Employees Whose Manager Left the Company

In [ ]:
Create table If Not Exists Employees (employee_id int, name varchar(20), manager_id int, salary int)
Truncate table Employees
insert into Employees (employee_id, name, manager_id, salary) values ('3', 'Mila', '9', '60301')
insert into Employees (employee_id, name, manager_id, salary) values ('12', 'Antonella', 'None', '31000')
insert into Employees (employee_id, name, manager_id, salary) values ('13', 'Emery', 'None', '67084')
insert into Employees (employee_id, name, manager_id, salary) values ('1', 'Kalel', '11', '21241')
insert into Employees (employee_id, name, manager_id, salary) values ('9', 'Mikaela', 'None', '50937')
insert into Employees (employee_id, name, manager_id, salary) values ('11', 'Joziah', '6', '28485')

In [30]:
database_creator('Leetcode_Q_1978')

In [31]:
schema = "employee_id int, name varchar(20), manager_id int, salary int"
data = [('3', 'Mila', '9', '60301'),
       ('12', 'Antonella', None, '31000'),
       ('13', 'Emery', None, '67084'),
       ('1', 'Kalel', '11', '21241'),
       ('9', 'Mikaela', None, '50937'),
       ('11', 'Joziah', '6', '28485')]

insert_data_to_table("Leetcode_Q_1978", "Employees", schema, data)

In [32]:
con = connector('Leetcode_Q_1978')

In [65]:
pd.read_sql("""
SELECT *
FROM Employees
""", con)

   employee_id       name  manager_id  salary
0            3       Mila         9.0   60301
1           12  Antonella         NaN   31000
2           13      Emery         NaN   67084
3            1      Kalel        11.0   21241
4            9    Mikaela         NaN   50937
5           11     Joziah         6.0   28485

In [74]:
pd.read_sql("""
SELECT employee_id
FROM Employees
WHERE manager_id NOT IN (
    SELECT employee_id FROM Employees
    ) AND
    salary < 30000
ORDER BY employee_id
""", con)

   employee_id
0           11

# Leetcode Question 1731: The Number of Employees Which Report to Each Employee

In [ ]:
Create table If Not Exists Employees(employee_id int, name varchar(20), reports_to int, age int)
Truncate table Employees
insert into Employees (employee_id, name, reports_to, age) values ('9', 'Hercy', 'None', '43')
insert into Employees (employee_id, name, reports_to, age) values ('6', 'Alice', '9', '41')
insert into Employees (employee_id, name, reports_to, age) values ('4', 'Bob', '9', '36')
insert into Employees (employee_id, name, reports_to, age) values ('2', 'Winston', 'None', '37')

In [33]:
database_creator('Leetcode_Q_1731')

In [34]:
schema = "employee_id int, name varchar(20), reports_to int, age int"
data = [('9', 'Hercy', None, '43'),
       ('6', 'Alice', '9', '41'),
       ('4', 'Bob', '9', '36'),
       ('2', 'Winston', None, '37')]

insert_data_to_table("Leetcode_Q_1731", "Employees", schema, data)

In [35]:
con = connector('Leetcode_Q_1731')

In [5]:
pd.read_sql("""
SELECT *
FROM Employees
""", con)

   employee_id     name  reports_to  age
0            9    Hercy         NaN   43
1            6    Alice         9.0   41
2            4      Bob         9.0   36
3            2  Winston         NaN   37

In [82]:
# I use Common Table Expression (CTE):

pd.read_sql("""
WITH cte AS(
SELECT 
    reports_to, 
    COUNT(employee_id) AS reports_count,
    ROUND(AVG(age), 0) AS average_age
FROM Employees
WHERE reports_to IS NOT NULL
GROUP BY reports_to
)
SELECT 
    c.reports_to AS employee_id,
    e.name, 
    c.reports_count,
    c.average_age
FROM cte c
LEFT JOIN Employees e
    ON c.reports_to = e.employee_id
ORDER BY employee_id
""", con)

   employee_id   name  reports_count  average_age
0            9  Hercy              2         39.0

In [36]:
# or

pd.read_sql("""

SELECT m.employee_id, m.name, COUNT(e.employee_id) AS reports_count, ROUND(AVG(e.age), 0) AS average_age
FROM Employees e
JOIN Employees m
    ON e.reports_to = m.employee_id
GROUP BY m.employee_id, m.name
ORDER BY m.employee_id
""", con)

/tmp/ipykernel_6016/2354022432.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

   employee_id   name  reports_count  average_age
0            9  Hercy              2         39.0

# Leetcode Question 1084: Sales Analysis III

In [ ]:
Create table If Not Exists Product (product_id int, product_name varchar(10), unit_price int)
Create table If Not Exists Sales (seller_id int, product_id int, buyer_id int, sale_date date, quantity int, price int)
Truncate table Product
insert into Product (product_id, product_name, unit_price) values ('1', 'S8', '1000')
insert into Product (product_id, product_name, unit_price) values ('2', 'G4', '800')
insert into Product (product_id, product_name, unit_price) values ('3', 'iPhone', '1400')
Truncate table Sales
insert into Sales (seller_id, product_id, buyer_id, sale_date, quantity, price) values ('1', '1', '1', '2019-01-21', '2', '2000')
insert into Sales (seller_id, product_id, buyer_id, sale_date, quantity, price) values ('1', '2', '2', '2019-02-17', '1', '800')
insert into Sales (seller_id, product_id, buyer_id, sale_date, quantity, price) values ('2', '2', '3', '2019-06-02', '1', '800')
insert into Sales (seller_id, product_id, buyer_id, sale_date, quantity, price) values ('3', '3', '4', '2019-05-13', '2', '2800')

In [37]:
database_creator('Leetcode_Q_1084')

In [38]:
schema = "product_id int, product_name varchar(10), unit_price int"
data = [('1', 'S8', '1000'),
       ('2', 'G4', '800'),
       ('3', 'iPhone', '1400')]

insert_data_to_table("Leetcode_Q_1084", "Product", schema, data)

In [39]:
schema = "seller_id int, product_id int, buyer_id int, sale_date date, quantity int, price int"
data = [('1', '1', '1', '2019-01-21', '2', '2000'),
       ('1', '2', '2', '2019-02-17', '1', '800'),
       ('2', '2', '3', '2019-06-02', '1', '800'),
       ('3', '3', '4', '2019-05-13', '2', '2800')]

insert_data_to_table("Leetcode_Q_1084", "Sales", schema, data)

In [40]:
con = connector('Leetcode_Q_1084')

In [5]:
pd.read_sql("""
SELECT *
FROM Product
""", con)

   product_id product_name  unit_price
0           1           S8        1000
1           2           G4         800
2           3       iPhone        1400

In [6]:
pd.read_sql("""
SELECT *
FROM Sales
""", con)

   seller_id  product_id  buyer_id   sale_date  quantity  price
0          1           1         1  2019-01-21         2   2000
1          1           2         2  2019-02-17         1    800
2          2           2         3  2019-06-02         1    800
3          3           3         4  2019-05-13         2   2800

In [30]:
pd.read_sql("""
SELECT 
    product_id,
    product_name
FROM Product p
JOIN Sales s
    USING (product_id)
GROUP BY product_id, product_name
HAVING MIN(sale_date) >= '2019-01-01' AND MAX(sale_date) <= '2019-03-31'

""", con)

   product_id product_name
0           1           S8

# Leetcode Question 1141: User Activity for the Past 30 Days I

In [ ]:
Create table If Not Exists Activity (user_id int, session_id int, activity_date date, activity_type ENUM('open_session', 'end_session', 'scroll_down', 'send_message'))
Truncate table Activity
insert into Activity (user_id, session_id, activity_date, activity_type) values ('1', '1', '2019-07-20', 'open_session')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('1', '1', '2019-07-20', 'scroll_down')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('1', '1', '2019-07-20', 'end_session')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('2', '4', '2019-07-20', 'open_session')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('2', '4', '2019-07-21', 'send_message')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('2', '4', '2019-07-21', 'end_session')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('3', '2', '2019-07-21', 'open_session')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('3', '2', '2019-07-21', 'send_message')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('3', '2', '2019-07-21', 'end_session')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('4', '3', '2019-06-25', 'open_session')
insert into Activity (user_id, session_id, activity_date, activity_type) values ('4', '3', '2019-06-25', 'end_session')

In [4]:
database_creator('Leetcode_Q_1141')

In [5]:
schema = "user_id int, session_id int, activity_date date, activity_type ENUM('open_session', 'end_session', 'scroll_down', 'send_message')"
data = [('1', '1', '2019-07-20', 'open_session'),
       ('1', '1', '2019-07-20', 'scroll_down'),
       ('1', '1', '2019-07-20', 'end_session'),
       ('2', '4', '2019-07-20', 'open_session'),
       ('2', '4', '2019-07-21', 'send_message'),
       ('2', '4', '2019-07-21', 'end_session'),
       ('3', '2', '2019-07-21', 'open_session'),
       ('3', '2', '2019-07-21', 'send_message'),
       ('3', '2', '2019-07-21', 'end_session'),
       ('4', '3', '2019-06-25', 'open_session'),
       ('4', '3', '2019-06-25', 'end_session')]

insert_data_to_table("Leetcode_Q_1141", "Activity", schema, data)

In [6]:
con = connector('Leetcode_Q_1141')

In [109]:
pd.read_sql("""
SELECT *
FROM Activity
""", con)

/tmp/ipykernel_4765/987028561.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

    user_id  session_id activity_date activity_type
0         1           1    2019-07-20  open_session
1         1           1    2019-07-20   scroll_down
2         1           1    2019-07-20   end_session
3         2           4    2019-07-20  open_session
4         2           4    2019-07-21  send_message
5         2           4    2019-07-21   end_session
6         3           2    2019-07-21  open_session
7         3           2    2019-07-21  send_message
8         3           2    2019-07-21   end_session
9         4           3    2019-06-25  open_session
10        4           3    2019-06-25   end_session

In [114]:
pd.read_sql("""
SELECT 
    activity_date AS day,
    COUNT(DISTINCT user_id) AS active_users
FROM Activity
GROUP BY activity_date
HAVING activity_date BETWEEN '2019-06-28' AND '2019-07-27'
""", con)

/tmp/ipykernel_4765/3159662318.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

          day  active_users
0  2019-07-20             2
1  2019-07-21             2

In [ ]:
# OR

In [116]:
pd.read_sql("""
SELECT 
    activity_date AS day,
    COUNT(DISTINCT user_id) AS active_users
FROM Activity
WHERE activity_date BETWEEN '2019-06-28' AND '2019-07-27'
GROUP BY  activity_date
""", con)

/tmp/ipykernel_4765/2781172801.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

          day  active_users
0  2019-07-20             2
1  2019-07-21             2

# Leetcode Question 596: Classes More Than 5 Students

In [ ]:
Create table If Not Exists Courses (student varchar(255), class varchar(255))
Truncate table Courses
insert into Courses (student, class) values ('A', 'Math')
insert into Courses (student, class) values ('B', 'English')
insert into Courses (student, class) values ('C', 'Math')
insert into Courses (student, class) values ('D', 'Biology')
insert into Courses (student, class) values ('E', 'Math')
insert into Courses (student, class) values ('F', 'Computer')
insert into Courses (student, class) values ('G', 'Math')
insert into Courses (student, class) values ('H', 'Math')
insert into Courses (student, class) values ('I', 'Math')

In [7]:
database_creator('Leetcode_Q_596')

In [8]:
schema = "student varchar(255), class varchar(255)"
data = [('A', 'Math'),
        ('B', 'English'),
       ('C', 'Math'),
       ('D', 'Biology'),
       ('E', 'Math'),
       ('F', 'Computer'),
       ('G', 'Math'),
       ('H', 'Math'),
       ('I', 'Math')]

insert_data_to_table("Leetcode_Q_596", "Courses", schema, data)

In [9]:
con = connector('Leetcode_Q_596')

In [45]:
pd.read_sql("""
SELECT *
FROM Courses
""", con)

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [49]:
pd.read_sql("""
SELECT 
    class
FROM Courses
GROUP BY class
HAVING COUNT(student) >= 5
""", con)

  class
0  Math

# Leetcode Question 197: Rising Temperature

In [ ]:
Create table If Not Exists Weather (id int, recordDate date, temperature int)
Truncate table Weather
insert into Weather (id, recordDate, temperature) values ('1', '2015-01-01', '10')
insert into Weather (id, recordDate, temperature) values ('2', '2015-01-02', '25')
insert into Weather (id, recordDate, temperature) values ('3', '2015-01-03', '20')
insert into Weather (id, recordDate, temperature) values ('4', '2015-01-04', '30')

In [10]:
database_creator('Leetcode_Q_197')

In [11]:
schema = "id int, recordDate date, temperature int"
data = [('1', '2015-01-01', '10'),
       ('2', '2015-01-02', '25'),
       ('3', '2015-01-03', '20'),
       ('4', '2015-01-04', '30')]

insert_data_to_table("Leetcode_Q_197", "Weather", schema, data)

In [12]:
con = connector('Leetcode_Q_197')

In [5]:
pd.read_sql("""
SELECT *
FROM Weather""", con)

   id  recordDate  temperature
0   1  2015-01-01           10
1   2  2015-01-02           25
2   3  2015-01-03           20
3   4  2015-01-04           30

In [19]:
pd.read_sql("""
SELECT w2.id
FROM Weather w1
JOIN Weather w2
    ON DATEDIFF(w1.recordDate, w2.recordDate) = -1
WHERE w2.temperature > w1.temperature
""", con)

   id
0   2
1   4

# Leetcode Question 1527: Patients With a Condition

In [ ]:
Create table If Not Exists Patients (patient_id int, patient_name varchar(30), conditions varchar(100))
Truncate table Patients
insert into Patients (patient_id, patient_name, conditions) values ('1', 'Daniel', 'YFEV COUGH')
insert into Patients (patient_id, patient_name, conditions) values ('2', 'Alice', '')
insert into Patients (patient_id, patient_name, conditions) values ('3', 'Bob', 'DIAB100 MYOP')
insert into Patients (patient_id, patient_name, conditions) values ('4', 'George', 'ACNE DIAB100')
insert into Patients (patient_id, patient_name, conditions) values ('5', 'Alain', 'DIAB201')

In [13]:
database_creator('Leetcode_Q_1527')

In [14]:
schema = "patient_id int, patient_name varchar(30), conditions varchar(100)"
data = [('1', 'Daniel', 'YFEV COUGH'),
       ('2', 'Alice', ''),
       ('3', 'Bob', 'DIAB100 MYOP'),
       ('4', 'George', 'ACNE DIAB100'),
       ('5', 'Alain', 'DIAB201')]

insert_data_to_table("Leetcode_Q_1527", "Patients", schema, data)

In [15]:
con = connector('Leetcode_Q_1527')

In [5]:
pd.read_sql("""
SELECT *
FROM Patients
""", con)

   patient_id patient_name    conditions
0           1       Daniel    YFEV COUGH
1           2        Alice
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100
4           5        Alain       DIAB201

In [23]:
pd.read_sql("""
SELECT *
FROM Patients
WHERE conditions LIKE 'DIAB1%' OR conditions LIKE '% DIAB1%'
""", con)

   patient_id patient_name    conditions
0           3          Bob  DIAB100 MYOP
1           4       George  ACNE DIAB100

## Medium difficulty questions:

# Leetcode Question 1393: Capital Gain/Loss

In [ ]:
Create Table If Not Exists Stocks (stock_name varchar(15), operation ENUM('Sell', 'Buy'), operation_day int, price int)
Truncate table Stocks
insert into Stocks (stock_name, operation, operation_day, price) values ('Leetcode', 'Buy', '1', '1000')
insert into Stocks (stock_name, operation, operation_day, price) values ('Corona Masks', 'Buy', '2', '10')
insert into Stocks (stock_name, operation, operation_day, price) values ('Leetcode', 'Sell', '5', '9000')
insert into Stocks (stock_name, operation, operation_day, price) values ('Handbags', 'Buy', '17', '30000')
insert into Stocks (stock_name, operation, operation_day, price) values ('Corona Masks', 'Sell', '3', '1010')
insert into Stocks (stock_name, operation, operation_day, price) values ('Corona Masks', 'Buy', '4', '1000')
insert into Stocks (stock_name, operation, operation_day, price) values ('Corona Masks', 'Sell', '5', '500')
insert into Stocks (stock_name, operation, operation_day, price) values ('Corona Masks', 'Buy', '6', '1000')
insert into Stocks (stock_name, operation, operation_day, price) values ('Handbags', 'Sell', '29', '7000')
insert into Stocks (stock_name, operation, operation_day, price) values ('Corona Masks', 'Sell', '10', '10000')

In [5]:
database_creator('Leetcode_Q_1393')

In [7]:
schema = "stock_name varchar(15), operation ENUM('Sell', 'Buy'), operation_day int, price int"
data = [ ('Leetcode', 'Buy', '1', '1000'),
       ('Corona Masks', 'Buy', '2', '10'),
       ('Leetcode', 'Sell', '5', '9000'),
       ('Handbags', 'Buy', '17', '30000'),
       ('Corona Masks', 'Sell', '3', '1010'),
       ('Corona Masks', 'Buy', '4', '1000'),
       ('Corona Masks', 'Sell', '5', '500'),
       ('Corona Masks', 'Buy', '6', '1000'),
       ('Handbags', 'Sell', '29', '7000'),
       ('Corona Masks', 'Sell', '10', '10000')]

insert_data_to_table("Leetcode_Q_1393", "Stocks", schema, data)

In [4]:
con = connector('Leetcode_Q_1393')

In [5]:
pd.read_sql("""
SELECT *
FROM Stocks
""", con)

/tmp/ipykernel_5811/202102921.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

     stock_name operation  operation_day  price
0      Leetcode       Buy              1   1000
1  Corona Masks       Buy              2     10
2      Leetcode      Sell              5   9000
3      Handbags       Buy             17  30000
4  Corona Masks      Sell              3   1010
5  Corona Masks       Buy              4   1000
6  Corona Masks      Sell              5    500
7  Corona Masks       Buy              6   1000
8      Handbags      Sell             29   7000
9  Corona Masks      Sell             10  10000

In [20]:
pd.read_sql("""

SELECT 
    stock_name, 
    SUM(CASE 
        WHEN operation = 'Sell' THEN price ELSE 0
    END) - SUM(CASE 
        WHEN operation = 'Buy' THEN price ELSE 0
    END) AS capital_gain_loss
FROM Stocks
GROUP BY stock_name
""", con)

/tmp/ipykernel_5811/1832767489.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("""

     stock_name  capital_gain_loss
0      Leetcode             8000.0
1  Corona Masks             9500.0
2      Handbags           -23000.0

# Leetcode Question 1204: Last Person to Fit in the Bus

In [ ]:
Create table If Not Exists Queue (person_id int, person_name varchar(30), weight int, turn int)
Truncate table Queue
insert into Queue (person_id, person_name, weight, turn) values ('5', 'Alice', '250', '1')
insert into Queue (person_id, person_name, weight, turn) values ('4', 'Bob', '175', '5')
insert into Queue (person_id, person_name, weight, turn) values ('3', 'Alex', '350', '2')
insert into Queue (person_id, person_name, weight, turn) values ('6', 'John Cena', '400', '3')
insert into Queue (person_id, person_name, weight, turn) values ('1', 'Winston', '500', '6')
insert into Queue (person_id, person_name, weight, turn) values ('2', 'Marie', '200', '4')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 608: Tree Node

In [ ]:
Create table If Not Exists Tree (id int, p_id int)
Truncate table Tree
insert into Tree (id, p_id) values ('1', 'None')
insert into Tree (id, p_id) values ('2', '1')
insert into Tree (id, p_id) values ('3', '1')
insert into Tree (id, p_id) values ('4', '2')
insert into Tree (id, p_id) values ('5', '2')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1934: Confirmation Rate

In [ ]:
Create table If Not Exists Signups (user_id int, time_stamp datetime)
Create table If Not Exists Confirmations (user_id int, time_stamp datetime, action ENUM('confirmed','timeout'))
Truncate table Signups
insert into Signups (user_id, time_stamp) values ('3', '2020-03-21 10:16:13')
insert into Signups (user_id, time_stamp) values ('7', '2020-01-04 13:57:59')
insert into Signups (user_id, time_stamp) values ('2', '2020-07-29 23:09:44')
insert into Signups (user_id, time_stamp) values ('6', '2020-12-09 10:39:37')
Truncate table Confirmations
insert into Confirmations (user_id, time_stamp, action) values ('3', '2021-01-06 03:30:46', 'timeout')
insert into Confirmations (user_id, time_stamp, action) values ('3', '2021-07-14 14:00:00', 'timeout')
insert into Confirmations (user_id, time_stamp, action) values ('7', '2021-06-12 11:57:29', 'confirmed')
insert into Confirmations (user_id, time_stamp, action) values ('7', '2021-06-13 12:58:28', 'confirmed')
insert into Confirmations (user_id, time_stamp, action) values ('7', '2021-06-14 13:59:27', 'confirmed')
insert into Confirmations (user_id, time_stamp, action) values ('2', '2021-01-22 00:00:00', 'confirmed')
insert into Confirmations (user_id, time_stamp, action) values ('2', '2021-02-28 23:59:59', 'timeout')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 626: Exchange Seats

In [ ]:
Create table If Not Exists Seat (id int, student varchar(255))
Truncate table Seat
insert into Seat (id, student) values ('1', 'Abbot')
insert into Seat (id, student) values ('2', 'Doris')
insert into Seat (id, student) values ('3', 'Emerson')
insert into Seat (id, student) values ('4', 'Green')
insert into Seat (id, student) values ('5', 'Jeames')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1321: Restaurant Growth

In [ ]:
Create table If Not Exists Customer (customer_id int, name varchar(20), visited_on date, amount int)
Truncate table Customer
insert into Customer (customer_id, name, visited_on, amount) values ('1', 'Jhon', '2019-01-01', '100')
insert into Customer (customer_id, name, visited_on, amount) values ('2', 'Daniel', '2019-01-02', '110')
insert into Customer (customer_id, name, visited_on, amount) values ('3', 'Jade', '2019-01-03', '120')
insert into Customer (customer_id, name, visited_on, amount) values ('4', 'Khaled', '2019-01-04', '130')
insert into Customer (customer_id, name, visited_on, amount) values ('5', 'Winston', '2019-01-05', '110')
insert into Customer (customer_id, name, visited_on, amount) values ('6', 'Elvis', '2019-01-06', '140')
insert into Customer (customer_id, name, visited_on, amount) values ('7', 'Anna', '2019-01-07', '150')
insert into Customer (customer_id, name, visited_on, amount) values ('8', 'Maria', '2019-01-08', '80')
insert into Customer (customer_id, name, visited_on, amount) values ('9', 'Jaze', '2019-01-09', '110')
insert into Customer (customer_id, name, visited_on, amount) values ('1', 'Jhon', '2019-01-10', '130')
insert into Customer (customer_id, name, visited_on, amount) values ('3', 'Jade', '2019-01-10', '150')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 570: Managers with at Least 5 Direct Reports

In [ ]:
Create table If Not Exists Employee (id int, name varchar(255), department varchar(255), managerId int)
Truncate table Employee
insert into Employee (id, name, department, managerId) values ('101', 'John', 'A', 'None')
insert into Employee (id, name, department, managerId) values ('102', 'Dan', 'A', '101')
insert into Employee (id, name, department, managerId) values ('103', 'James', 'A', '101')
insert into Employee (id, name, department, managerId) values ('104', 'Amy', 'A', '101')
insert into Employee (id, name, department, managerId) values ('105', 'Anne', 'A', '101')
insert into Employee (id, name, department, managerId) values ('106', 'Ron', 'B', '101')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1045: Customers Who Bought All Products

In [ ]:
Create table If Not Exists Customer (customer_id int, product_key int)
Create table Product (product_key int)
Truncate table Customer
insert into Customer (customer_id, product_key) values ('1', '5')
insert into Customer (customer_id, product_key) values ('2', '6')
insert into Customer (customer_id, product_key) values ('3', '5')
insert into Customer (customer_id, product_key) values ('3', '6')
insert into Customer (customer_id, product_key) values ('1', '6')
Truncate table Product
insert into Product (product_key) values ('5')
insert into Product (product_key) values ('6')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1164: Product Price at a Given Date

In [ ]:
Create table If Not Exists Products (product_id int, new_price int, change_date date)
Truncate table Products
insert into Products (product_id, new_price, change_date) values ('1', '20', '2019-08-14')
insert into Products (product_id, new_price, change_date) values ('2', '50', '2019-08-14')
insert into Products (product_id, new_price, change_date) values ('1', '30', '2019-08-15')
insert into Products (product_id, new_price, change_date) values ('1', '35', '2019-08-16')
insert into Products (product_id, new_price, change_date) values ('2', '65', '2019-08-17')
insert into Products (product_id, new_price, change_date) values ('3', '20', '2019-08-18')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1193: Monthly Transactions I

In [ ]:
Create table If Not Exists Transactions (id int, country varchar(4), state enum('approved', 'declined'), amount int, trans_date date)
Truncate table Transactions
insert into Transactions (id, country, state, amount, trans_date) values ('121', 'US', 'approved', '1000', '2018-12-18')
insert into Transactions (id, country, state, amount, trans_date) values ('122', 'US', 'declined', '2000', '2018-12-19')
insert into Transactions (id, country, state, amount, trans_date) values ('123', 'US', 'approved', '2000', '2019-01-01')
insert into Transactions (id, country, state, amount, trans_date) values ('124', 'DE', 'approved', '2000', '2019-01-07')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1907: Count Salary Categories

In [ ]:
Create table If Not Exists Accounts (account_id int, income int)
Truncate table Accounts
insert into Accounts (account_id, income) values ('3', '108939')
insert into Accounts (account_id, income) values ('2', '12747')
insert into Accounts (account_id, income) values ('8', '87709')
insert into Accounts (account_id, income) values ('6', '91796')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1174: Immediate Food Delivery II

In [ ]:
Create table If Not Exists Delivery (delivery_id int, customer_id int, order_date date, customer_pref_delivery_date date)
Truncate table Delivery
insert into Delivery (delivery_id, customer_id, order_date, customer_pref_delivery_date) values ('1', '1', '2019-08-01', '2019-08-02')
insert into Delivery (delivery_id, customer_id, order_date, customer_pref_delivery_date) values ('2', '2', '2019-08-02', '2019-08-02')
insert into Delivery (delivery_id, customer_id, order_date, customer_pref_delivery_date) values ('3', '1', '2019-08-11', '2019-08-12')
insert into Delivery (delivery_id, customer_id, order_date, customer_pref_delivery_date) values ('4', '3', '2019-08-24', '2019-08-24')
insert into Delivery (delivery_id, customer_id, order_date, customer_pref_delivery_date) values ('5', '3', '2019-08-21', '2019-08-22')
insert into Delivery (delivery_id, customer_id, order_date, customer_pref_delivery_date) values ('6', '2', '2019-08-11', '2019-08-13')
insert into Delivery (delivery_id, customer_id, order_date, customer_pref_delivery_date) values ('7', '4', '2019-08-09', '2019-08-09')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 178: Rank Scores

In [ ]:
Create table If Not Exists Scores (id int, score DECIMAL(3,2))
Truncate table Scores
insert into Scores (id, score) values ('1', '3.5')
insert into Scores (id, score) values ('2', '3.65')
insert into Scores (id, score) values ('3', '4.0')
insert into Scores (id, score) values ('4', '3.85')
insert into Scores (id, score) values ('5', '4.0')
insert into Scores (id, score) values ('6', '3.65')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 602: Friend Requests II: Who Has the Most Friends

In [ ]:
Create table If Not Exists RequestAccepted (requester_id int not null, accepter_id int null, accept_date date null)
Truncate table RequestAccepted
insert into RequestAccepted (requester_id, accepter_id, accept_date) values ('1', '2', '2016/06/03')
insert into RequestAccepted (requester_id, accepter_id, accept_date) values ('1', '3', '2016/06/08')
insert into RequestAccepted (requester_id, accepter_id, accept_date) values ('2', '3', '2016/06/08')
insert into RequestAccepted (requester_id, accepter_id, accept_date) values ('3', '4', '2016/06/09')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1158: Market Analysis I

In [ ]:
Create table If Not Exists Users (user_id int, join_date date, favorite_brand varchar(10))
Create table If Not Exists Orders (order_id int, order_date date, item_id int, buyer_id int, seller_id int)
Create table If Not Exists Items (item_id int, item_brand varchar(10))
Truncate table Users
insert into Users (user_id, join_date, favorite_brand) values ('1', '2018-01-01', 'Lenovo')
insert into Users (user_id, join_date, favorite_brand) values ('2', '2018-02-09', 'Samsung')
insert into Users (user_id, join_date, favorite_brand) values ('3', '2018-01-19', 'LG')
insert into Users (user_id, join_date, favorite_brand) values ('4', '2018-05-21', 'HP')
Truncate table Orders
insert into Orders (order_id, order_date, item_id, buyer_id, seller_id) values ('1', '2019-08-01', '4', '1', '2')
insert into Orders (order_id, order_date, item_id, buyer_id, seller_id) values ('2', '2018-08-02', '2', '1', '3')
insert into Orders (order_id, order_date, item_id, buyer_id, seller_id) values ('3', '2019-08-03', '3', '2', '3')
insert into Orders (order_id, order_date, item_id, buyer_id, seller_id) values ('4', '2018-08-04', '1', '4', '2')
insert into Orders (order_id, order_date, item_id, buyer_id, seller_id) values ('5', '2018-08-04', '1', '3', '4')
insert into Orders (order_id, order_date, item_id, buyer_id, seller_id) values ('6', '2019-08-05', '2', '2', '4')
Truncate table Items
insert into Items (item_id, item_brand) values ('1', 'Samsung')
insert into Items (item_id, item_brand) values ('2', 'Lenovo')
insert into Items (item_id, item_brand) values ('3', 'LG')
insert into Items (item_id, item_brand) values ('4', 'HP')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1341: Movie Rating

In [ ]:
Create table If Not Exists Movies (movie_id int, title varchar(30))
Create table If Not Exists Users (user_id int, name varchar(30))
Create table If Not Exists MovieRating (movie_id int, user_id int, rating int, created_at date)
Truncate table Movies
insert into Movies (movie_id, title) values ('1', 'Avengers')
insert into Movies (movie_id, title) values ('2', 'Frozen 2')
insert into Movies (movie_id, title) values ('3', 'Joker')
Truncate table Users
insert into Users (user_id, name) values ('1', 'Daniel')
insert into Users (user_id, name) values ('2', 'Monica')
insert into Users (user_id, name) values ('3', 'Maria')
insert into Users (user_id, name) values ('4', 'James')
Truncate table MovieRating
insert into MovieRating (movie_id, user_id, rating, created_at) values ('1', '1', '3', '2020-01-12')
insert into MovieRating (movie_id, user_id, rating, created_at) values ('1', '2', '4', '2020-02-11')
insert into MovieRating (movie_id, user_id, rating, created_at) values ('1', '3', '2', '2020-02-12')
insert into MovieRating (movie_id, user_id, rating, created_at) values ('1', '4', '1', '2020-01-01')
insert into MovieRating (movie_id, user_id, rating, created_at) values ('2', '1', '5', '2020-02-17')
insert into MovieRating (movie_id, user_id, rating, created_at) values ('2', '2', '2', '2020-02-01')
insert into MovieRating (movie_id, user_id, rating, created_at) values ('2', '3', '2', '2020-03-01')
insert into MovieRating (movie_id, user_id, rating, created_at) values ('3', '1', '3', '2020-02-22')
insert into MovieRating (movie_id, user_id, rating, created_at) values ('3', '2', '4', '2020-02-25')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 585: Investments in 2016

In [ ]:
Create Table If Not Exists Insurance (pid int, tiv_2015 float, tiv_2016 float, lat float, lon float)
Truncate table Insurance
insert into Insurance (pid, tiv_2015, tiv_2016, lat, lon) values ('1', '10', '5', '10', '10')
insert into Insurance (pid, tiv_2015, tiv_2016, lat, lon) values ('2', '20', '20', '20', '20')
insert into Insurance (pid, tiv_2015, tiv_2016, lat, lon) values ('3', '10', '30', '20', '20')
insert into Insurance (pid, tiv_2015, tiv_2016, lat, lon) values ('4', '10', '40', '40', '40')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 184: Department Highest Salary

In [ ]:
Create table If Not Exists Employee (id int, name varchar(255), salary int, departmentId int)
Create table If Not Exists Department (id int, name varchar(255))
Truncate table Employee
insert into Employee (id, name, salary, departmentId) values ('1', 'Joe', '70000', '1')
insert into Employee (id, name, salary, departmentId) values ('2', 'Jim', '90000', '1')
insert into Employee (id, name, salary, departmentId) values ('3', 'Henry', '80000', '2')
insert into Employee (id, name, salary, departmentId) values ('4', 'Sam', '60000', '2')
insert into Employee (id, name, salary, departmentId) values ('5', 'Max', '90000', '1')
Truncate table Department
insert into Department (id, name) values ('1', 'IT')
insert into Department (id, name) values ('2', 'Sales')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 1070: Product Sales Analysis III

In [ ]:
Create table If Not Exists Sales (sale_id int, product_id int, year int, quantity int, price int)
Create table If Not Exists Product (product_id int, product_name varchar(10))
Truncate table Sales
insert into Sales (sale_id, product_id, year, quantity, price) values ('1', '100', '2008', '10', '5000')
insert into Sales (sale_id, product_id, year, quantity, price) values ('2', '100', '2009', '12', '5000')
insert into Sales (sale_id, product_id, year, quantity, price) values ('7', '200', '2011', '15', '9000')
Truncate table Product
insert into Product (product_id, product_name) values ('100', 'Nokia')
insert into Product (product_id, product_name) values ('200', 'Apple')
insert into Product (product_id, product_name) values ('300', 'Samsung')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 180: Consecutive Numbers

In [ ]:
Create table If Not Exists Logs (id int, num int)
Truncate table Logs
insert into Logs (id, num) values ('1', '1')
insert into Logs (id, num) values ('2', '1')
insert into Logs (id, num) values ('3', '1')
insert into Logs (id, num) values ('4', '2')
insert into Logs (id, num) values ('5', '1')
insert into Logs (id, num) values ('6', '2')
insert into Logs (id, num) values ('7', '2')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 550: Game Play Analysis IV

In [ ]:
Create table If Not Exists Activity (player_id int, device_id int, event_date date, games_played int)
Truncate table Activity
insert into Activity (player_id, device_id, event_date, games_played) values ('1', '2', '2016-03-01', '5')
insert into Activity (player_id, device_id, event_date, games_played) values ('1', '2', '2016-03-02', '6')
insert into Activity (player_id, device_id, event_date, games_played) values ('2', '3', '2017-06-25', '1')
insert into Activity (player_id, device_id, event_date, games_played) values ('3', '1', '2016-03-02', '0')
insert into Activity (player_id, device_id, event_date, games_played) values ('3', '4', '2018-07-03', '5')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 176: Second Highest Salary

In [ ]:
Create table If Not Exists Employee (id int, salary int)
Truncate table Employee
insert into Employee (id, salary) values ('1', '100')
insert into Employee (id, salary) values ('2', '200')
insert into Employee (id, salary) values ('3', '300')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 177: Nth Highest Salary

In [ ]:
Create table If Not Exists Employee (Id int, Salary int)
Truncate table Employee
insert into Employee (id, salary) values ('1', '100')
insert into Employee (id, salary) values ('2', '200')
insert into Employee (id, salary) values ('3', '300')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

## From here on Hard difficulty questions

# Leetcode Question 185: Department Top Three Salaries

In [ ]:
Create table If Not Exists Employee (id int, name varchar(255), salary int, departmentId int)
Create table If Not Exists Department (id int, name varchar(255))
Truncate table Employee
insert into Employee (id, name, salary, departmentId) values ('1', 'Joe', '85000', '1')
insert into Employee (id, name, salary, departmentId) values ('2', 'Henry', '80000', '2')
insert into Employee (id, name, salary, departmentId) values ('3', 'Sam', '60000', '2')
insert into Employee (id, name, salary, departmentId) values ('4', 'Max', '90000', '1')
insert into Employee (id, name, salary, departmentId) values ('5', 'Janet', '69000', '1')
insert into Employee (id, name, salary, departmentId) values ('6', 'Randy', '85000', '1')
insert into Employee (id, name, salary, departmentId) values ('7', 'Will', '70000', '1')
Truncate table Department
insert into Department (id, name) values ('1', 'IT')
insert into Department (id, name) values ('2', 'Sales')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 601: Human Traffic of Stadium

In [ ]:
Create table If Not Exists Stadium (id int, visit_date DATE NULL, people int)
Truncate table Stadium
insert into Stadium (id, visit_date, people) values ('1', '2017-01-01', '10')
insert into Stadium (id, visit_date, people) values ('2', '2017-01-02', '109')
insert into Stadium (id, visit_date, people) values ('3', '2017-01-03', '150')
insert into Stadium (id, visit_date, people) values ('4', '2017-01-04', '99')
insert into Stadium (id, visit_date, people) values ('5', '2017-01-05', '145')
insert into Stadium (id, visit_date, people) values ('6', '2017-01-06', '1455')
insert into Stadium (id, visit_date, people) values ('7', '2017-01-07', '199')
insert into Stadium (id, visit_date, people) values ('8', '2017-01-09', '188')

In [ ]:
database_creator('Leetcode_Q_')

In [ ]:
schema = " "
data = [ ]

insert_data_to_table("Leetcode_Q_", "", schema, data)

In [ ]:
con = connector('')

In [ ]:
pd.read_sql("""
SELECT *
FROM 
""", con)

# Leetcode Question 262: Trips and Users

In [ ]:
Create table If Not Exists Trips (id int, client_id int, driver_id int, city_id int, status ENUM('completed', 'cancelled_by_driver', 'cancelled_by_client'), request_at varchar(50))
Create table If Not Exists Users (users_id int, banned varchar(50), role ENUM('client', 'driver', 'partner'))
Truncate table Trips
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('1', '1', '10', '1', 'completed', '2013-10-01')
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('2', '2', '11', '1', 'cancelled_by_driver', '2013-10-01')
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('3', '3', '12', '6', 'completed', '2013-10-01')
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('4', '4', '13', '6', 'cancelled_by_client', '2013-10-01')
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('5', '1', '10', '1', 'completed', '2013-10-02')
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('6', '2', '11', '6', 'completed', '2013-10-02')
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('7', '3', '12', '6', 'completed', '2013-10-02')
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('8', '2', '12', '12', 'completed', '2013-10-03')
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('9', '3', '10', '12', 'completed', '2013-10-03')
insert into Trips (id, client_id, driver_id, city_id, status, request_at) values ('10', '4', '13', '12', 'cancelled_by_driver', '2013-10-03')
Truncate table Users
insert into Users (users_id, banned, role) values ('1', 'No', 'client')
insert into Users (users_id, banned, role) values ('2', 'Yes', 'client')
insert into Users (users_id, banned, role) values ('3', 'No', 'client')
insert into Users (users_id, banned, role) values ('4', 'No', 'client')
insert into Users (users_id, banned, role) values ('10', 'No', 'driver')
insert into Users (users_id, banned, role) values ('11', 'No', 'driver')
insert into Users (users_id, banned, role) values ('12', 'No', 'driver')
insert into Users (users_id, banned, role) values ('13', 'No', 'driver')

In [13]:
database_creator('Leetcode_Q_262')

In [16]:
schema = "id int, client_id int, driver_id int, city_id int, status ENUM('completed', 'cancelled_by_driver', 'cancelled_by_client'), request_at varchar(50)"
data = [('1', '1', '10', '1', 'completed', '2013-10-01'),
       ('2', '2', '11', '1', 'cancelled_by_driver', '2013-10-01'),
       ('3', '3', '12', '6', 'completed', '2013-10-01'),
       ('4', '4', '13', '6', 'cancelled_by_client', '2013-10-01'),
       ('5', '1', '10', '1', 'completed', '2013-10-02'),
       ('6', '2', '11', '6', 'completed', '2013-10-02'),
       ('7', '3', '12', '6', 'completed', '2013-10-02'),
       ('8', '2', '12', '12', 'completed', '2013-10-03'),
       ('9', '3', '10', '12', 'completed', '2013-10-03'),
       ('10', '4', '13', '12', 'cancelled_by_driver', '2013-10-03')]

insert_data_to_table("Leetcode_Q_262", "Trips", schema, data)

In [17]:
schema = "users_id int, banned varchar(50), role ENUM('client', 'driver', 'partner')"
data = [('1', 'No', 'client'),
        ('2', 'Yes', 'client'),
         ('3', 'No', 'client'),
        ('4', 'No', 'client'),
        ('10', 'No', 'driver'),
         ('11', 'No', 'driver'),
         ('12', 'No', 'driver'),
        ('13', 'No', 'driver')]

insert_data_to_table("Leetcode_Q_262", "Users", schema, data)

In [18]:
con = connector('Leetcode_Q_262')

In [19]:
pd.read_sql("""
SELECT *
FROM Trips
""", con)

   id  client_id  driver_id  city_id               status  request_at
0   1          1         10        1            completed  2013-10-01
1   2          2         11        1  cancelled_by_driver  2013-10-01
2   3          3         12        6            completed  2013-10-01
3   4          4         13        6  cancelled_by_client  2013-10-01
4   5          1         10        1            completed  2013-10-02
5   6          2         11        6            completed  2013-10-02
6   7          3         12        6            completed  2013-10-02
7   8          2         12       12            completed  2013-10-03
8   9          3         10       12            completed  2013-10-03
9  10          4         13       12  cancelled_by_driver  2013-10-03

In [20]:
pd.read_sql("""
SELECT *
FROM Users
""", con)

   users_id banned    role
0         1     No  client
1         2    Yes  client
2         3     No  client
3         4     No  client
4        10     No  driver
5        11     No  driver
6        12     No  driver
7        13     No  driver